{"path":"speakers/michelle-mras","templateID":4,"sharedPropsHashes":{},"localProps":{"speaker":{"id":"michelle-mras","firstName":"Michelle","lastName":"Mras","bio":"Michelle Mras “has a peculiar ability: she is actually two people. She is either the best speaker you’ve ever heard, or she’s the best speaker you’ve never heard. She has an irresistible presence and she commands your attention and interest like a tractor beam. Few people can elicit the sense of togetherness and empowerment that she does. Michelle is an exemplar of all things the world could and should be!” - Client \r\n\r\nMichelle has background in Engineering, Economics, Financial Institutions, Marketing Management, Quality Systems Management, Performance Examination Boards, Benefit Auctioneering, Political Campaigning, National Public Radio's Moth Hour and the TEDx Colorado Springs stage. \r\n\r\nDespite her diverse background, her greatest accomplishments are that she traveled the world as a military spouse and daughter, has raised two well-adjusted young adults, and is a survivor of multiple life challenges to include a Traumatic Brain Injury and Breast Cancer. Michelle is a powerful survivor who elicits a positivity that engulfs those in her presence to believe and be driven to achieve more personally and professionally. \r\n\r\nMichelle is an Internationally recognized Keynote Speaker, Success Coach, Corporate Trainer, Executive Director Certified with the John Maxwell Team, Specialist in Human Behavior, Certified Reclaim the Brilliance Facilitator and a Radio Talk Show Host of Conversations with Michelle on KCMJ, 93.9FM. She also leads live online trainings for the International group FUZIA World, and the GL Bajaj Institute of Technology & Management in Greater Noida, India.\r\n\r\nMichelle's quest is to lift others to recognize when they are stuck in life and how to escape the trap to thrive toward their future. She is the Author of two published books: Eat, Drink and Be Mary - A Glimpse Into a Life Well Lived, which is also the title of her 2015 TEDx Talk, and It’s Not Luck: Overcoming You. \r\n\r\nShe recently received the John Maxwell Team Culture Award for demonstrating a positive attitude out of over 8,000 coaches world-wide and travelled to New Delhi, India to receive the Women’s Economic Forum’s Exceptional Woman of Excellence Award for Inspiration.\r\n\r\nTidbit of inside information about me: I have a habit of breaking out into a R&B or Broadway songs. ","title":"Why Do They Do That?","description":"This fun and eye-opening activity will truly unleash participates views of themselves and those they interact with. Participants learn their basic behavior style and how to better communicate to other behavior styles through the use of BANKCODE. Audiences laugh, bond and quickly realize why miscommunications occurred within past interactions and how to avoid them problems in the future. Together, they learn how to clearly communicate with each other. They receive immediate validation of what is being taught through confirmation from the other behavior groups. ","organization":"Mras Inc","photo":"/photos/michelleMras.jpg"},"nextId":"mike-douglas","previousId":"michael-eaton"}}
