[
    {
        "id": "paul-gower",
        "firstName": "Paul",
        "lastName": "Gower",
        "bio": "Paul started his career as a software developer in 2001 developing client/server enterprise solutions. An innovative problem solver, Paul uses in-depth analysis, deep consultation and the latest software development practices to serve his clients. In 2014 Paul started his company Lunamark (http://lumamark.com), where he leverages his years of experience to help companies improve their software development team's efficiency using techniques such as clean coding practices, code reviews, pair programming, and kanban. Paul is a certified Kanban Management Professional, Kanban Training for HugeIO, and is constantly learning new ways to improve flow efficiency.",
        "title": "Overcoming Delay: How The Best Developers Increase Productivity",
        "description": "In the software industry, it’s common to be on a project with an aggressive timeline.  Even if the schedule was correct, plans don't always go the way you expect and become off track. Teams end up working more extended hours, try to add people to the project or make other heroic efforts to try and “save the day’ and finish on time.  In my experience, rarely have those efforts worked and when it did, the team was so burned out it took several weeks to get motivated to tackle another project.\r\n\r\nThere should be a better way to complete projects on time, so teams feel a sense of accomplishment and are excited to take on the next project. In this session, we discuss three key behaviors you can do with your team, unlocking a better way to work to help the team succeed.\r\n\r\n",
        "organization": "Lunamark",
        "photo": "/photos/paulGower.jpg"
    },
    {
        "id": "sandi-barr",
        "firstName": "Sandi",
        "lastName": "Barr",
        "bio": "Currently a Senior Software Engineer at PRX, Sandi has many years professional experience as a software developer, from the back to the front end and in between. She has created intensive, data-driven applications in various industries from the financial markets, agriculture, defense, and now in podcasting. Sandi also enjoys sharing her expertise and experience with others in the software field, and especially identifies with those who are underrepresented in tech. She founded Omaha Coding Women, Omaha Girls Who Code, and Mystery Code Society, organizations that exist to create a sense of belonging and help girls and women excel in tech. She has also run Django Girls and Node School workshops in her local community and helps to organize the annual Nebraska JavaScript Conference.",
        "title": "NgRx: Redux-style State Management in Angular",
        "description": "We’ve heard that using TypeScript can help us avoid painful bugs programmers commonly run into when writing JavaScript by type-checking our code. One of purposes of TypeScript is to “statically identify constructs that are likely to be errors”. With NgRx we can take advantage of this type safety by using TypeScript classes as action creators with readonly type properties, so we can then infer the action object types in our state management code.\r\n\r\nNgRx provides a structuring mechanism for larger applications; it's a design pattern teaches you how to think. In this pattern, the developer needs to identify the streams of values the application is interested in and how they are combined to produce meaningful information for the view layer. The streams, the various applications states, and the view layer models are what we are setting out to define when we use Redux-style state management. This talk will show how to use the various NgRx reactive libraries for Angular state management to build out our application streams and then consume them in our components and services.\r\n\r\n",
        "organization": "PRX",
        "photo": "/photos/sandiBarr.jpg"
    },
    {
        "id": "jeremy-clark",
        "firstName": "Jeremy",
        "lastName": "Clark",
        "bio": "Jeremy Clark makes developers better. By drawing on over 15 years of experience in application development, he helps developers take a step up in their skill set with a focus on making complex topics approachable regardless of skill level. He is a Microsoft MVP for .NET, and he has authored seven courses for Pluralsight, including \"C# Interfaces\", a course aimed at giving developers a clear understanding of abstraction. He loves speaking and has delivered over 250 technical presentations in the last 9 years in the United States and Europe. Jeremy lives in northern Washington with his wife, 2 cats, a hound dog, and a banjo. ",
        "title": "Becoming a Social Developer: A Guide for Introverts",
        "description": "This is NOT a highly-interactive workshop. Now that you feel a bit safer, make the most of your time here: talk to other developers. This is easy -- and incredibly terrifying. A few simple steps (and a bit of bravery) is all that it takes to get started. Building your developer network will boost your knowledge, your skills, and your career. Can an introvert become a social developer? YES! And we can do this while staying true to ourselves.",
        "organization": "",
        "photo": "/photos/jeremyClark.jpg"
    },
    {
        "id": "patrick-wolff",
        "firstName": "Patrick",
        "lastName": "Wolff",
        "bio": "Patrick is passionate about collaboration, human computer interaction, graphic design and problem solving. His degree in Digital Imaging from the University of Nebraska at Omaha led him down a career path that includes television, advertising, Flash development for online learning, web development, enterprise application development, Geographic Information Systems, and leadership. Currently, Patrick serves as VP of Applications Development at Farm Credit Services of America.",
        "title": "Grow The Future With Internship 2.0",
        "description": "Farm Credit Services of America has a different take on what an Internship experience should be. We took the idea of an Internship, and made it AWESOME! The Intern Program is team based, and allows a small group of software development students to work together on a team along with four or five full-time mentors and leaders to create a greenfield enterprise application. The experience allows the students to iterate through the full software development life cycle in an enterprise environment: from sketching out wire-frames to deploying an enterprise application in Production. \r\n\r\nWe will also talk through how we do our intern interviews differently. Our interviews do not consist of the traditional sit-down interview with questions. We have a fun and relaxed process that let's the candidates express their creativity, collaboration, problem solving, and their personality. This helps to insure that we are investing in people that fit our culture.\r\n\r\nOne of the greatest benefits to our approach is that the students get an experience of what life is like in the real world. The amount of learning that happens when you apply the theory that's been learned in school across the entirety of the software development life-cycle in highly-collaborative enterprise team environment is indescribable. ",
        "organization": "Farm Credit Services of America",
        "photo": "/photos/patrickWolff.jpg"
    },
    {
        "id": "thomas-cleberg",
        "firstName": "Thomas",
        "lastName": "Cleberg",
        "bio": "",
        "title": "Model Management: The Least You Can Do",
        "description": "Data science projects are most visible right after initial delivery, but the data science team’s responsibility goes far beyond that. This talk introduces the basics of ModelOps, Model Lifecycle Management, an operational model for data science team work products, and common open-source tools for achieving a minimum level of transparency, reproducibility, and risk management for those produces.",
        "organization": "Mutual of Omaha",
        "photo": "/photos/thomasCleberg.jpg"
    },
    {
        "id": "javier-lozano",
        "firstName": "Javier",
        "lastName": "Lozano",
        "bio": "Javier is founder of Lozanotek, Inc., a Microsoft focused software development boutique based in Des Moines, IA. His specializations are in ASP.NET, Azure, system design, and developer mentoring. Javier is also an ASP.NET Insider, Azure Insider, and has been awarded the Microsoft MVP Award for over 12 years for all of his contributions to products and community. For fun, Javier runs and manages the popular .NET Conf virtual conference. He’s is an avid supporter of the community and likes to give back by speaking at user groups, local/regional/national .NET events. In his spare time, Javier loves spending time with his family and enjoys writing about himself in the third person.",
        "title": ".NET Yesterday, Today, and Tomorrow",
        "description": "Trying to make sense of .NET Core and .NET Standard? Looking for ways to reuse your current .NET Framework code? In this session we will cover how you can take your existing .NET Framework code and reuse it in your .NET Standard/Core applications with ease.",
        "organization": "Lozanotek, Inc.",
        "photo": "/photos/javierLozano.jpg"
    },
    {
        "id": "michelle-mras",
        "firstName": "Michelle",
        "lastName": "Mras",
        "bio": "Michelle Mras “has a peculiar ability: she is actually two people. She is either the best speaker you’ve ever heard, or she’s the best speaker you’ve never heard. She has an irresistible presence and she commands your attention and interest like a tractor beam. Few people can elicit the sense of togetherness and empowerment that she does. Michelle is an exemplar of all things the world could and should be!” - Client \r\n\r\nMichelle has background in Engineering, Economics, Financial Institutions, Marketing Management, Quality Systems Management, Performance Examination Boards, Benefit Auctioneering, Political Campaigning, National Public Radio's Moth Hour and the TEDx Colorado Springs stage. \r\n\r\nDespite her diverse background, her greatest accomplishments are that she traveled the world as a military spouse and daughter, has raised two well-adjusted young adults, and is a survivor of multiple life challenges to include a Traumatic Brain Injury and Breast Cancer. Michelle is a powerful survivor who elicits a positivity that engulfs those in her presence to believe and be driven to achieve more personally and professionally. \r\n\r\nMichelle is an Internationally recognized Keynote Speaker, Success Coach, Corporate Trainer, Executive Director Certified with the John Maxwell Team, Specialist in Human Behavior, Certified Reclaim the Brilliance Facilitator and a Radio Talk Show Host of Conversations with Michelle on KCMJ, 93.9FM. She also leads live online trainings for the International group FUZIA World, and the GL Bajaj Institute of Technology & Management in Greater Noida, India.\r\n\r\nMichelle's quest is to lift others to recognize when they are stuck in life and how to escape the trap to thrive toward their future. She is the Author of two published books: Eat, Drink and Be Mary - A Glimpse Into a Life Well Lived, which is also the title of her 2015 TEDx Talk, and It’s Not Luck: Overcoming You. \r\n\r\nShe recently received the John Maxwell Team Culture Award for demonstrating a positive attitude out of over 8,000 coaches world-wide and travelled to New Delhi, India to receive the Women’s Economic Forum’s Exceptional Woman of Excellence Award for Inspiration.\r\n\r\nTidbit of inside information about me: I have a habit of breaking out into a R&B or Broadway songs. ",
        "title": "Why Do They Do That?",
        "description": "This fun and eye-opening activity will truly unleash participates views of themselves and those they interact with. Participants learn their basic behavior style and how to better communicate to other behavior styles through the use of BANKCODE. Audiences laugh, bond and quickly realize why miscommunications occurred within past interactions and how to avoid them problems in the future. Together, they learn how to clearly communicate with each other. They receive immediate validation of what is being taught through confirmation from the other behavior groups. ",
        "organization": "Mras Inc",
        "photo": "/photos/michelleMras.jpg"
    },
    {
        "id": "simon-yost",
        "firstName": "Simon",
        "lastName": "Yost",
        "bio": "I empower teams to close the gap between design and engineering so that digital experiences connect people. While specializing in maximizing the potential of multi-disciplinary teams, I create sustainable, nimble digital experiences and technical solutions.\r\n\r\nI have spent 15 years building organizations (startups, nonprofits, and enterprise) in the Midwest region by spearheading digital strategy and content delivery. That includes countless hours coaching professionals and students on building applications, creating digital experiences, and installing systems in their businesses. I currently serve as a technology consultant at Slalom St. Louis.\r\n\r\nOutside of work, I am a husband, father, amateur cyclist, and self-professed coffee aficionado. My passions include foster/adopt parenting and Nebraska football.",
        "title": "Closing the Fidelity Gap with UI Engineering",
        "description": "In 2018 the US market for digital transformation was $437 billion which reflects 16.8% growth year-over-year (Shirer & Smith, 2017). Simultaneously, two-thirds of all business leaders believe that their companies must pick up the pace of digitalization to remain competitive (Moore, 2017). Yet, even with this demand, teams implement solutions that lack of agility. Tangoe’s Murray lays it out: “Developers are coding to specific spec sheets with little conceptual understanding of how this button or feature fits within the overall user experience.”\r\n\r\nThe lack of agility and conceptual understanding of the whole results in a gap—the fidelity gap—where the marriage design and engineering is not as strong as the product creators intended. Symptoms may include a lack of consistency, responsiveness, navigation, and accessibility (Abramov, 2018).\r\n\r\nJoin Simon Yost to explore filling the fidelity gap with stack-neutral concepts and practices that engineering and design teams can work together to champion on any stack.",
        "organization": "Slalom Consulting",
        "photo": "/photos/simonYost.jpg"
    },
    {
        "id": "cassandra-faris",
        "firstName": "Cassandra",
        "lastName": "Faris",
        "bio": "Cassandra Faris is passionate about the human side of technology. Her career has focused on supporting tech professionals through community outreach, hiring, mentoring, and employee engagement. She is an international speaker who specializes in teaching people how to be more effective team members and advance their careers.  She is also the President of the Microsoft and open source conference, DogFoodCon, and a Per Scholas Advisory Board member. She has an MBA in Organizational Leadership. When she's not busy with the tech community, she is avid tabletop gamer, runner, and soccer fan who travels as much as possible.",
        "title": "Health: The Most Important Dev Tool",
        "description": "Working in the tech industry often involves spending long hours sitting down, staring at a screen, consuming copious amounts of pizza and caffeine. The work is mentally demanding and can be stressful. In the rush to get everything done, it can be easy to neglect our health. But a healthy body and mind are necessary for effective performance. Based on HR training, research, and personal experience, this session provides realistic suggestions for managing your well-being at work. It covers the connection between physical and mental health, as well as how to discuss these topics with your employer. You’ll leave with a better idea of how to take care of yourself and be a happier, healthier, more productive person.",
        "organization": "",
        "photo": "/photos/cassandraFaris.jpeg"
    },
    {
        "id": "greg-dick",
        "firstName": "Greg",
        "lastName": "Dick",
        "bio": "I'm a Senior Engineering Team Lead at Hudl. My role as a team lead could be more accurately described as a coach. I have a passion for helping people, and I take that into my management role in form of coaching my reports to become better engineers, finding the best ways to motivate them, and providing them with authentic connections and meaningful relationships.",
        "title": "Inverting the Management Relationship",
        "description": "In most manager/employee relationships, the employee is a resource for the manager. The manager has a goal, something they are responsible for, and the employee is helping them to meet their goal. When it goes well, the manager is also providing feedback and coaching that helps the employee improve and grow their career. When it doesn't go well, the manager's goals trump the needs of the employee, and the employee must sink or swim. Often times, these two dynamics are at odds with each other and can even put the manager in a difficult position.\r\n\r\nAt Hudl, we took a different approach. We used a form a matrix management where managers don't typically work on the same team as their reports. We removed the delegating aspect from management, and this led to a completely different dynamic in the manager/report relationship. It actually inverted the relationship where it is now clear that the manager is a resource for the report. Our managers focus their efforts on coaching and growing the skills of their reports. Our successes are seeing our reports meet their goals. \r\n\r\nThis dynamic provides an interesting mix of pros and cons. I'll talk through those as well as the logistics of running a product team with this structure. My goal is for anyone in a more traditional org structure to start thinking about the benefits of changing up their structure.",
        "organization": "Hudl",
        "photo": "/photos/gregDick.jpg"
    },
    {
        "id": "charlie-koster",
        "firstName": "Charlie",
        "lastName": "Koster",
        "bio": "I'm a Tech Lead and Senior Developer who enjoys finding and exploring disruptive ideas and technology. Genetic Algorithms, Augmented Reality, Elm, you name it. I care about what works over the long term and I'm always on the hunt to find that genuine idea that has the right balance of simplicity, disruption, and potential.",
        "title": "AI Doesn't Have to Be Hard",
        "description": "Artificial Intelligence can be an intimidating topic to approach. You might be thinking that it’s a topic perhaps better handled by academia or tech giants like Google.. Nonsense! In this talk we will explore some of the lesser known AI algorithms including Markov Chains, Genetic Algorithms, and K-Means clustering in a beginner friendly way. By the end of this talk you'll be armed with the knowledge to write your own AI solutions and you'll recognize the kinds of business problems that are suited for each technique.",
        "organization": "Aviture",
        "photo": "/photos/charlieKoster.jpg"
    },
    {
        "id": "katia-wheeler",
        "firstName": "Katia",
        "lastName": "Wheeler",
        "bio": "Katia Wheeler is a Software Engineer based in Kansas City. While growing up, she was constantly at the computer, either playing a rousing game of The Sims (let’s be honest, she was putting them all in the pool and taking away the ladder) or creating new Xanga layouts. As she got older (and Xanga faded from society), she dabbled more in the .NET space and some JavaScript frameworks.\r\n\r\nIn her current role, she focuses on managing the ReactUI on the front-end as well as some additional .NET Core API work. She has also dabbled in machine learning (Skynet), iOS and Android development, and does freelance WordPress development on the side.\r\n\r\nWhen she’s not coding, Katia can be found drinking massive amounts of coffee (seriously, ungodly amounts), biking, [attempting to blog](https://medium.com/@wheeler.katia), playing a video game, or simply maniacally laughing while stroking one of her two cats in an armchair.",
        "title": "Thinking About React, Atomically",
        "description": "Atomic Design is the concept of breaking down user interfaces into smaller, simpler elements. There are five different levels in atomic design: atoms, molecules, organism, templates, and pages. These levels are combined to make user interfaces.\r\n\r\nReact, at its core, follows Atomic Design inherently by encouraging developers to keep components as simple and as broken down as possible. From this simplicity, we can create more complex components and containers of components to create the user interfaces for our applications. Following these patterns gives us, as developers, an easy to manage (and test) ecosystem within our React applications.\r\n\r\nDuring this talk, we'll dive into the roots of Atomic Design and how we can apply these design principles to our React applications.",
        "organization": "Balance Innovations",
        "photo": "/photos/katiaWheeler.jpeg"
    },
    {
        "id": "mike-hostetler",
        "firstName": "Mike",
        "lastName": "Hostetler",
        "bio": "Mike has almost 20 years of experience in technology. He started in networking and Unix administration, and grew into technical support and QA testing. But he has always done some development on the side and decided a few years ago to pursue it full-time. His history of working with users gives Mike a unique perspective on writing software.",
        "title": "Python for the Curious",
        "description": "Python is used in many applications today and yet some people seem mystified by it. Maybe it's the whitespace, maybe it's dynamic typing, maybe it's because it seems... too clean looking. Yet Python is useful for one-off scripts and for full-blown web applications (just ask Instagram or Pinterest). And Python is becoming the de facto language in many data science applications. We will touch on all this, show some examples, and make fun of \"enterprise\" languages as we look at a simple, yet powerful, language.",
        "organization": "Object Partners, Inc",
        "photo": "/photos/mikeHostetler.jpg"
    },
    {
        "id": "michael-eaton",
        "firstName": "Michael",
        "lastName": "Eaton",
        "bio": "Michael Eaton is the Director of Engineering at Matched Patter. He is a speaker, leader, developer, voracious reader and lover of heavy metal.",
        "title": "Leadership Journey: From Software Developer to Leader",
        "description": "You’ve spent years working on your technical skills and can write code with the best of them. Then, one day, a leadership position opens up on your team, and you start thinking about it. Should I or shouldn’t I? What if I hate it? What if I love it? What if I'm not that good at it? In this interactive session, we’ll explore “why leadership,” answer some hard questions, and talk about one developer’s path from writing code to leading people.",
        "organization": "Matched Pattern",
        "photo": "/photos/michaelEaton.jpg"
    },
    {
        "id": "jason-swett",
        "firstName": "Jason",
        "lastName": "Swett",
        "bio": "Jason Swett helps Rails developers write better tests. Since putting his first website online in 1996, he has taught programming in four countries and worked for organizations like AT&T, Deloitte and the University of Chicago. Jason lives in Sand Lake, Michigan.",
        "title": "Using Tests as a Tool to Wrangle Legacy Projects",
        "description": "Most code in the world is legacy code. Legacy projects tend to be lacking in test coverage. Unfortunately, legacy projects are often written in such a way that it makes it difficult to add tests - tests that are badly needed in order to start paying down technical debt and get the project on the right track.\r\n\r\nFortunately there are some effective ways of wrangling legacy code into submission. If we can break apart a legacy project's entanglement of dependencies, making the code more modular and loosely coupled, we can add tests more easily. But breaking apart dependencies is tricky and requires a few certain techniques in order to be done safely.\r\n\r\nMain points:\r\n\r\n- Why legacy projects are harder to test than greenfield projects\r\n\r\n- Why adding tests to legacy projects is risky\r\n\r\n- How to mitigate the risks of modifying legacy code\r\n\r\n- What dependency injection is, why it’s useful in testing legacy projects, and how to use it\r\n\r\n- How to break dependencies using Michael Feathers’ “sprout class” technique",
        "organization": "",
        "photo": "/photos/jasonSwett.jpg"
    },
    {
        "id": "kathy-i-andersen",
        "firstName": "Kathy I.",
        "lastName": "Andersen",
        "bio": "Kathy is a Scrum Master at Hudl. There, she has the honor of serving the talented teams on the business side of the Hudl's efforts to market, sell, support, and report on the company's products and services. Kathy took an uncommon route to the software world. She went from running a microfinance nonprofit to working at a startup incubator, and there she took the dive into product/software development.\r\n\r\nOn one of her early projects, she ramped up on the scrum framework and agile concepts more broadly. That's how she fell in love with the idea that there really are ways to setup individuals to do their best work and to setup teams to be greater than the sum of their parts. Today you'll find her speaking at conferences and participating in the agile and product development communities in Lincoln, Omaha, and beyond.",
        "title": "Something's Rotten in the State of Quality",
        "description": "Developers, do you really trust QAs when they find a 'bug'? QA folks, do you believe that developers have tested their work before they hand it over? You may identify with this atmosphere of contention surrounding QA. But there’s one underlying question for every team: are we building a quality product?\r\n\r\nThe definition of quality should go beyond a list of test cases executed against requirements. From the father of the quality revolution, Edward Deming, to the work of Martin Fowler and Mike Cohn, we’ll lay a theoretical groundwork for what quality is, then we will showcase these definitions with examples. We’ll end with specific activities along the software development life cycle that actually help assure quality. You’ll take away what it truly means to assure quality as well as ways to start putting it into practice.\r\n\r\nIf you’re a developer, project manager, product owner, BA, or QA tester, this talk is for you.",
        "organization": "Hudl",
        "photo": "/photos/kathyAndersen.jpg"
    },
    {
        "id": "nicholas-tuck",
        "firstName": "Nicholas",
        "lastName": "Tuck",
        "bio": "Nicholas Tuck is an all purpose software gardener with a broad range of experience from startups, to enterprise level web services. He's worked in many industries including Air Force Weather, Locomotives, Property Management, Health, and most recently Online Live Auctions.  Nick's 'Why' is to impact the world through game changing software solutions. He believes in finding the right tools for the right job and has spent the last decade experimenting with many of them.  He experiments with technical tools, like languages, libraries and architectures, as well as processes like true continuous integration and ShipIt Days.  On top of technological achievements, Nick has formed cultures of change, innovation and empowered teams. He believes in radical candor and is prepared to rock the boat to accelerate change. He's a Software Gardener at Proxibid and a Co-Founder of the Agile for Defense meetup in the Omaha area, spreading these practices to the military industry. Nick's goal as a speaker is to share the discoveries and experiments of his career and help others accelerate their productive abilities by breaking away from the socially accepted notions of programming. You can find more ideas from Nick at http://TheSoftwareGardener.com.\r\n\r\n-- “Technology innovation isn't about giving people what they want but what they don’t know they need.”",
        "title": "Something's Rotten in the State of Quality",
        "description": "Developers, do you really trust QAs when they find a 'bug'? QA folks, do you believe that developers have tested their work before they hand it over? You may identify with this atmosphere of contention surrounding QA. But there’s one underlying question for every team: are we building a quality product?\r\n\r\nThe definition of quality should go beyond a list of test cases executed against requirements. From the father of the quality revolution, Edward Deming, to the work of Martin Fowler and Mike Cohn, we’ll lay a theoretical groundwork for what quality is, then we will showcase these definitions with examples. We’ll end with specific activities along the software development life cycle that actually help assure quality. You’ll take away what it truly means to assure quality as well as ways to start putting it into practice.\r\n\r\nIf you’re a developer, project manager, product owner, BA, or QA tester, this talk is for you",
        "organization": "Proxibid",
        "photo": "/photos/nicholasTuck.jpg"
    },
    {
        "id": "ash-banaszek",
        "firstName": "Ash",
        "lastName": "Banaszek",
        "bio": "I am an Associate of User Experience (UX) at a Fortune 150 company. Aside from my role as a seasoned UXer at my company, I also train developers and business analysts the basics of UX. I have a passion for teaching and getting folks to that \"ah-hah\" moment about UX. I am an avid proponent of creating technology people want to use--instead of technology that get people so frustrated that they want to chuck it out of a window.  I'm also a huge Bioware nerd and will talk your ear off about Mass Effect or Dragon Age if you dare only ask...",
        "title": "Fear, Pain, and Loathing: Empathizing with your Users' Plight",
        "description": "You're a developer given a relatively straightforward assignment: replace an old application with a new technology. \"Make it easy to use... Make it sharp! Oh, and don't change anything.\"\r\n\r\nThis session discusses the basics of user interface usability from a user's perspective. When your application is live, the user is the person who will be using that system day in and day out. They determine your application's success or failure by adopting, undermining, or abandoning your application. With such importance, it is imperative to have some understanding of your users' requirements, constraints, and goals. This session will help you develop skills to build empathy and better communicate with your users, while also meeting the needs and requirements of your project stakeholders.",
        "organization": "Union Pacific",
        "photo": "/photos/ashBanaszek.jpg"
    },
    {
        "id": "jeff-fritz",
        "firstName": "Jeff",
        "lastName": "Fritz",
        "bio": "Jeff Fritz is a senior program manager in Microsoft’s Developer Division working on the .NET Community Team.  Four days a week, you can catch Jeff hosting a live video stream called 'Fritz and Friends' at twitch.tv/csharpfritz. You can follow him on twitter @csharpfritz, and read his blogs at jeffreyfritz.com and blogs.msdn.microsoft.com/webdev ",
        "title": "Zero to Community Hero - Start Live Coding on Twitch",
        "description": "You're at a conference, and learning a ton. That's awesome, but how do you continue learning after the event? Let's break out of just socializing and learning from the folks in our local geographic area, and embrace a more global community using the Twitch live video platform to write code, discuss technology topics, and even broadcast local user-groups. \r\n\r\nWe'll go beyond just playing Fortnite or League of Legends, and talk about hosting educational content on Twitch. Join one of the leaders of this movement, Jeff Fritz as he gives you an inside look at how to get started streaming, participating, and building new communities with online video",
        "organization": "Microsoft",
        "photo": "/photos/jeffFritz.jpg"
    },
    {
        "id": "alison-hawke",
        "firstName": "Alison",
        "lastName": "Hawke",
        "bio": "I'm the director of quality advocacy for WWT Asynchrony Labs, serving a team of over forty testers in five cities. My goal is to write code that breaks code to make a better product for the user. I train technical testers who can help a team release awesome products that make client's lives better. I've been in QA since 2005 and I love getting into the code to test more thoroughly. I've written test code in Java, C#, JavaScript, and I am currently learning Elixir. Outside work, I'm a black belt in Chinese Kenpo and have fun sparring every week. I also knit a lot of hats. Originally from England.",
        "title": "A Hero's Journey: Manual Tester to Automation QA",
        "description": "**Prologue: Once Upon A Time in Software**\r\n\r\n \r\n\r\nOnce there was a project that was frustrating, it had lots of bugs and made the team unhappy. For the next project, we tried something new: the QA on the team would learn C# and she would write automated tests before the developers started coding. The team was happy, and the app runs to this day with only bugs caused by bad data the client told us could never exist. \r\n\r\nThe end. Or is it really... The Beginning?\r\n\r\nThis talk is the story of a learning quest, what I've discovered along the way teaching QAs to write test automation in Java, C#, and JavaScript, and my own journey of picking up new languages for fun, like Elixir. It is aimed at QA testers who want to broaden their testing skills, and at developers who want to help them get there. No prior coding knowledge is required for the QAs.",
        "organization": "WWT Asynchrony Labs",
        "photo": "/photos/alisonHawke.jpg"
    },
    {
        "id": "cameron-presley",
        "firstName": "Cameron",
        "lastName": "Presley",
        "bio": "Cameron Presley is a software engineer, avid boardgamer, and Microsoft MVP living in Oak Ridge, Tennessee. He currently works for SentryOne as a software engineer focusing on improving the lives of Microsoft Data Professionals!\r\n\r\nWhen not slinging code for his day job, Cameron spends his time organizing content for the  @FunctionalKnox user group, co-organizing LambdaSquared and CodeStock conferences, and mentoring others through Code Connective.",
        "title": "How Functional Programming Made Me A Better Developer",
        "description": "With the rise in popularity recently, functional programming has become \"The Next Big Thing\". As of today, there are tons of frameworks and tools that can be used to for front-end, back-end, desktop, and mobile development. With that being said, the majority of us are still using object-oriented languages for our day jobs and don't need to learn functional programming, right?\r\n\r\nIn this talk, I'll walk you through my experiences learning functional programming over the last year, how my style of programming has changed, and now how I think about programming with regards to both functional and object-oriented paradigms",
        "organization": "SentryOne",
        "photo": "/photos/cameronPresley.jpg"
    },
    {
        "id": "arthur-doler",
        "firstName": "Arthur",
        "lastName": "Doler",
        "bio": "Arthur (or Art, take your pick) has been a software engineer for 14 years and has worked on things as exciting as analysis software for casinos and things as boring as banking websites. He is an advocate for talking openly about psychology and mental health in the technical world, and he spends a lot of time thinking about how we program and why we program, and about the tools, structures, cultures, and mental processes that help and hinder us from our ultimate goal of writing amazing things. His hair is brown and his thorax is a shiny blue color.",
        "title": "How to Work with People: A Guide to Playing Nicely with Others",
        "description": "Humans. No matter what we might wish, we have to work with them to get stuff done. Unfortunately, when we join a team it doesn’t come with a manual. Figuring out how to get things done and get everyone pulling in the same direction can be a nightmare.\r\n\r\nBut it doesn’t have to be! In this example-driven talk you’ll learn what a personality type is, you’ll learn some methods for communicating better with others, and you’ll dip a toe into the psychology of team dynamics - all without having to read a huge textbook or a bunch of manager-focused books trying to sell you something. You’ll come away with tools you can use to be a better teammate and to create a stronger team, regardless of your role. Let’s get started actually working together!",
        "organization": "Aviture",
        "photo": "/photos/arthurDoler.jpg"
    },
    {
        "id": "john-henry-muller",
        "firstName": "John Henry",
        "lastName": "Müller",
        "bio": "John Henry Müller is a Design Director at Hudl, a sports technology software used by teams around the world (including Premier League, NBA, NHL, NFL, NCAA, and 98% of high school football teams). At Hudl, he focuses on visual design spanning both product and brand design, with a team of over 30 designers. John Henry led the visual direction of Uniform, Hudl's design system.\r\n\r\nBefore Hudl, John Henry was the design cofounder of a startup called Pack. Before that, he founded a design/dev consultancy called What Cheer, with clients including Squidoo, Hayneedle, Union Pacific Railroad, US Department of Energy and Saddle Creek Records. John Henry lives in Benson, Omaha, Nebraska with his wife, daughter, dog and two cats. He sits on the board of Big Omaha and Maha Music Festival. He was gluten-free before (and after) it was cool.",
        "title": "From Color Palette to Color System",
        "description": "Color touches literally every pixel of digital products. That's why it is so important to get color right in a design system.\r\n\r\nIn this talk, John Henry Müller (Design Director at Hudl) divulges mistakes made and practical lessons learned about color while creating Uniform, Hudl's design system.\r\n\r\nWhat you'll learn:\r\n\r\n* Tips and tricks creating a durable color scheme \r\n\r\n* Common pitfalls when defining a color palette\r\n\r\n* Understand color contrast for accessibility ",
        "organization": "",
        "photo": "/photos/johnHenry.jpg"
    },
    {
        "id": "beth-laing",
        "firstName": "Beth",
        "lastName": "Laing",
        "bio": "Beth grew-up in online journalism, working with newspaper companies in Atlanta, GA, San Jose, CA and Saint Paul, MN with a detour to work for an internet start-up, Infonautics, in Philadelphia, PA along the way.  After leaving the world of newspapers, Beth worked as a project manager for several organizations focused on the intersection of news, society and technology. In 2015 she transitioned into software development with the help of a full immersion bootcamp. As one of the directors for Women Who Code's Atlanta chapter, Beth works to create great programming and build community for the amazing women in technology of Atlanta.  She is passionate about making technology a welcoming community for everyone and breaking down barriers. Beth works as a software developer at CNN/Turner on a variety of projects for internal customer. She spends a lot of time figuring out why things don't work and how to fix them!\r\n\r\n",
        "title": "You're Hired! Avoiding missteps and false starts in your new job",
        "description": "Congratulations on your new job... now what! Starting a new job, especially if it’s your first one, is always exciting... and stressful. Here’s how to take control of the situation and make sure that you’re ready to start strong from day one. As superficial as it sounds, you want to look your best when you are meeting so many people for the first time. But you should dress appropriately for your environment - a suit would be out of place in most technical organizations. The what not to wear part is easy… but what should you wear? Getting the people part right is key.First, ask a lot of questions. Use the 70/30 rule -- ask questions 70% of the time and share your stories and ideas 30% of the time. This is your chance to learn about the company, your project and the people that you will be working with, so you want to spend most of your time listening. Be ready with a plan for getting up-to-speed, even if all the parts are not in place when you start. Chances are your accounts and access might not be fully functional from day one, so be ready with things to do in the meantime. You’ll leave with a checklist of things to do so you walk in the door on day one ready to go.",
        "organization": "Women Who Code, Atlanta",
        "photo": "/photos/bethLaing.jpg"
    },
    {
        "id": "courtney-heitman",
        "firstName": "Courtney",
        "lastName": "Heitman",
        "bio": "Courtney's passion for the web all started with teaching her 11-year-old self how to write CSS on a dial-up internet connection on a farm in rural Iowa. Since then she has been in a myriad of positions including a Flash developer for several higher ed institutions, a Joomla developer, a brief stint as a server admin, a designer, a full stack developer, and a project manager. Currently, Courtney is a UX Developer, Scrum Master, and Accessibility Compliance Specialist for Gallup in Omaha, Nebraska. Her passion is making a web that is usable and accessible to all.",
        "title": "Mapping the User's Journey",
        "description": "Do you feel like you don't actually know your users? Do they struggle through the flow of your website, and you don’t know why? \r\n\r\nThis session will introduce you to empathy mapping, and how it will help you to relate to your users better. Once we have some empathy (mapping), we'll go over user journey mapping, so we can better understand what questions and pain points our users are having as they move through our site.",
        "organization": "Gallup",
        "photo": "/photos/courtneyHeitman.jpg"
    },
    {
        "id": "jon-mills",
        "firstName": "Jonathan",
        "lastName": "Mills",
        "bio": "Jonathan is a Pluralsight Author, Technology Advisor, and Business Leader. As a member of the Chief Digital Advisory team at World Wide Technology, Jonathan is able to leverage his unique experiences and skills to drive digital transformation for his clients.\r\n\r\nAs a dedicated developer community leader, Jonathan serves on the board of directors for the Kansas City Developers Conference, Microsoft MVP, and is a regular speaker and keynote presenter at conferences around the globe. ",
        "title": "Keeping Up",
        "description": "Hey, what are your thoughts on Docker? How about Kubernetes? Have you started looking at Vue yet? Although, WebAssembly will replace JavaScript before too long..... Every time I go to an event, I am hit with questions like this. I often feel like I am running up a down escalator and simply can't keep up. Do you ever feel overwhelmed with the constantly changing landscape of software development? Every time we turn around there is something new to keep our eye on. In this session, I encourage you to stop for a minute and take a breath. I will work you through some resources and skills that will help you trim back the noise and allow you to focus on the things that are really important and simply keep an awareness of the rest. ",
        "photo": "/photos/jonMills.jpg",
        "organization": "World Wide Technology"
    },
    {
        "id": "jeff-strauss",
        "firstName": "Jeff",
        "lastName": "Strauss",
        "bio": "Jeff is a technical architect, an executive consultant, and an attorney. As a member of the Chief Digital Advisor team at World Wide Technology—and with his unique experiences that combine tech and the law—he maintains a passion for solving problems with inspired solutions, improving life and business through technology.\r\n\r\nA dedicated member of the developer community, Jeff travels internationally to speak on both technical and business-oriented topics. He is a Microsoft MVP and serves on the board of directors for the Kansas City Developer Conference.",
        "title": "Starting Over",
        "description": "Adversity. A necessary component of life. Inevitably, we all reach professional and personal moments that require us to take a deep breath and a giant step back. Moving forward again often feels difficult, even impossible. We suffer, immobilized by fear. But fear is more than some pesky roadblock. It is a rational response to adversity. Whether facing a major code refactoring, the changing technology landscape, a new role, or even a fresh career, we can learn to leverage fear and uncertainty to move beyond our hurdles and get the job done! Key life skills exist that can be developed to conquer adversity. Learn to assess risks, build relationships, and recognize opportunities for growth. Starting over may seem insurmountable. Armed with the right skills, perspective, and a little patience, nothing truly is.",
        "photo": "/photos/jeffStraus.jpg",
        "organization": "World Wide Technology"
    },
    {
        "id": "mike-douglas",
        "firstName": "Mike",
        "lastName": "Douglas",
        "bio": "Mike Douglas is a Solution Consultant at Deliveron Consulting Services.  He specializes in working with development teams to implement Secure DevOps and Application Lifecycle Management (ALM) solutions to eliminate traditional silos between development, testing, project management, and operations to establish cohesive processes from idea to production.    He is also a Microsoft Visual Studio and Developer Technologies MVP and an Microsoft ALM Ranger",
        "organization": "Deliveron Consulting Services",
        "title": "Securing Your CI/CD Pipeline",
        "description": "Jeff is a technical architect, an executive consultant, and an attorney. As a member of the Chief Digital Advisor team at World Wide Technology—and with his unique experiences that combine tech and the law—he maintains a passion for solving problems with inspired solutions, improving life and business through technology. A dedicated member of the developer community, Jeff travels internationally to speak on both technical and business-oriented topics. He is a Microsoft MVP and serves on the board of directors for the Kansas City Developer Conference.\r\n",
        "photo": "/photos/mikeDouglas.jpg"
    },
    {
        "id": "mat-warger",
        "firstName": "Mat",
        "lastName": "Warger",
        "email": "mwarger@gmail.com",
        "bio": "Mat Warger is a consultant with Keyhole Software.  He enjoys learning new concepts and has leveraged this curiosity in positions ranging from startups to the enterprise over the past decade.  He can be found chasing the latest and (sometimes) greatest in a wide range of languages and platforms, including React, GraphQL, and the cloud.  Find him on twitter @mwarger.",
        "organization": "Keyhole Software",
        "title": "Bootstrap Your App with AWS Amplify!",
        "description": "Front-end development can be complicated. There are enough libraries and enough churn to make anyone feel lost in the shuffle. Common concerns for any modern web application include features like authentication, user content, APIs, and analytics. In this session, you will get a break-down and demo of the key features of AWS Amplify, an open-source toolchain from Amazon. Amplify abstracts away the common functionality that so many applications share and allows developers to focus on building – not plumbing! This session will walk through a simple application high-lighting the features and tools the library provides. This should leave you with the knowledge of \"how and why\" you would integrate this with your own projects. The session will use React to demonstrate the features of the library, but general front-end development experience is all that is required.",
        "photo": "/photos/matWarger.jpg"
    },
    {
        "id": "matt-busche",
        "firstName": "Matt",
        "lastName": "Busche",
        "email": "mrbusche@gmail.com",
        "bio": "Husband, Dad, programmer, and speaker. Responsible and Responsive Design enthusiast. Wheel of Fortune expert. Graduate of the University of Northern Iowa.",
        "organization": "",
        "title": "Secure by Design",
        "description": "​​As developers we need to build secure software, but can't possibly know everything about security. Secure-by-design is a guiding principle for building software. By tackling security issues when designing an application security is no longer an afterthought after the project has been completed. We'll learn how good design drives security by using patterns, mindsets, and best practices for real world development. We'll also discuss how to find and address flaws in existing code and most importantly we'll discuss how good design encourages security by using domain primitives, the builder pattern, error handling, and validation.  Finally we'll discuss tools that can help prevent these flaws from making it into your code repository, these can be ran on your local machine or as a hook in your continuous integration process.",
        "photo": "/photos/mattBusche.jpg"
    },
    {
        "id": "jerry-koske",
        "firstName": "Jerry",
        "lastName": "Koske",
        "email": "jerry.koske@aviture.us.com",
        "bio": "Jerry is writing this bio, so let’s drop the third person. I’m in my 25th year of ‘professional’ software development, although I’ve been writing code since before the age of 10. My biggest driver is making a real difference in software solutions for people. That journey has led me through the roles of programmer, architect, technical manager, and ultimately crossed into the ‘enemy territory’ of upper management. I try to use my role as a force for good, not evil. The biggest focus in my life are my three smart, funny, and beautiful daughters which I spend as much time as I can with before they outgrow me.",
        "organization": "Aviture",
        "title": "Winning the war on Bureaucracy",
        "description": "Bureaucracy, we’ve all experienced it. We often see it as the enemy of common sense. But do we need all of it? How do you enforce discipline without it? What can you affect when you are a cog in a machine?\r\n\r\nTelecommunications, Finance, Insurance, Government – I’ve been employed in all these industries and have experienced the very worst of what bureaucracy has to offer. Currently, I’m fortunate enough to be part of a ‘great experiment’ to create better engineering environments at Aviture. In this talk I’ll share the trials and tribulations we’ve experienced. We’ll discuss what has worked, what hasn’t, and what you can do to combat unnecessary bureaucracy in your own environment. This includes expanding your sphere of influence. No matter where you are in the organization, you aren’t helpless.\r\n\r\nIf you’d like to remove unnecessary bureaucracy in your own environment, you should find this talk useful.",
        "photo": "/photos/jerryKoske.jpg"
    },
    {
        "id": "herb-scruggs",
        "firstName": "Herb",
        "lastName": "Scruggs",
        "email": "herb.scruggs@fcsamerica.com",
        "bio": "Herb is a Quality Assurance Developer at Farm Credit Services of America. He has 20 years experience in Development and Quality Assurance roles. His passion is Software Automation with experience in testing software in Web, Mobile and REST API. He is always looking for the next best technology to make quality better in his work environment.",
        "organization": "Farm Credit Services of America",
        "title": "Lean Quality Delivery",
        "description": "Lean Quality Delivery is our quality framework encompassing three aspects of developing quality software - functional quality, structural quality, and process quality.  Core to this framework is an understanding that quality and testing are not the same thing.  Every step in the agile development life-cycle impacts quality, therefore every team member is responsible for and has an active part to play in quality.  Fully embracing the shift-left mentality, it is built on a foundation of lean/agile processes, developer best practices, and a risk-based testing philosophy.",
        "photo": "/photos/herbscruggs.jpg"
    },
    {
        "id": "scot-ringenberg",
        "firstName": "Scot",
        "lastName": "Ringenberg",
        "email": "smr@suiter.com",
        "bio": "Scot M. Ringenberg is a patent attorney and co-owner of Suiter Swantz IP. He received his Bachelor’s Degree in Chemical Engineering from the University of Nebraska Lincoln and his Juris Doctor from the University of Nebraska College of Law. Scot continued his education with the University of Kansas Electrical Engineering and Computer Science Department graduate studies program. He is registered to practice as an attorney before the United States Patent and Trademark Office. Additionally, he has been admitted to the state bars of Nebraska, Kansas, and Missouri.\r\n\r\nScot is also a member of numerous professional and community associations including the State Bar Associations of Nebraska, Missouri, and Kansas, the Institute of Electrical and Electronics Engineers, the American Institute of Chemical Engineers, the American Intellectual Property Law Association and the University of Nebraska-Lincoln Alumni Association. When not practicing Intellectual Property law, Scot enjoys golfing, traveling, attending his family’s numerous activities, and following University of Nebraska Athletics.",
        "organization": "Suiter Swantz",
        "title": "Protecting Your Innovation – Patent Protection and the Patent Process",
        "description": "Intellectual property law can be used to protect a number of intangible assets. These assets may include inventions, names, logos, symbols, software code, writings, designs, music, recipes, and similar intellectual works. Suiter Swantz IP is a full-service intellectual property law firm that provides client-centric, worldwide protection for your patent, trademark, and copyright needs. We have helped many diverse organizations ranging from individual inventors to early-stage startups to international multi-billion-dollar corporations navigate the complex landscape of intellectual property procurement and protection for more than 20 years. If you any have any questions regarding intellectual property, be sure to stop by and speak with us!",
        "photo": "/photos/scotRingenberg.jpg"
    },
    {
        "id": "levi-liester",
        "firstName": "Levi",
        "lastName": "Liester",
        "email": "levi.liester@proxibid.com",
        "bio": "Corgis, coding, and caffeine, that’s what I do.  I enjoy practicing my craft as a Digital Alchemist at Proxibid. I’m also constantly searching for side projects for fun and profit.  The more people who find value in what I build the better.  I’m not interested in building solutions no one uses.  I’ve worked with a variety of businesses; from startups to enterprises, contracting and full time.  I value transparency in business and personal interactions, and I will rock the boat to get it.",
        "organization": "Proxibid",
        "title": "Protecting Your Innovation – Patent Protection and the Patent Process",
        "description": "",
        "photo": "/photos/leviLiester.jpg"
    }
]
