[
  {
    "id": "ryan-hochstetler",
    "firstName": "Ryan",
    "lastName": "Hochstetler",
    "bio": "Ryan is a recovering enterprise Java developer who now slings Ruby and Go on the daily at Flywheel to keep tens of thousands of Kubernetes-hosted WordPress instances running smoothly. Outside work he enjoys woodworking, auto maintenance, brewing beer, long bike rides with his family, and even longer rides on his motorcycle.",
    "title": "You don’t know ML and neither do we",
    "description": "But that’s fine, Google does! Google Cloud Vision AI is an approachable collection of deep learning algorithms that enables high quality visual analysis on any application.  But will the actual analysis meet your expectations? Finding millions of images to put Cloud Vision through its paces is just an Instagram away. With both Cloud Vision and Instagram in combination, this talk will show the highs and lows of using this advanced imaging technology, no data science degree required.",
    "organization": "Flywheel - Delightful managed WordPress hosting",
    "photoUrl": "https://secure.gravatar.com/avatar/9fbe73d4c6d3fd15a9635249a5989eed?s=500",
    "photo": "/photos/speakers/ryan-hochstetler.png"
  },
  {
    "id": "andrew-wirick",
    "firstName": "Andrew",
    "lastName": "Wirick",
    "bio": "Andrew Wirick is a software architect and long-time front-end software aficionado. He has a passion for focusing on the human challenges of leveraging software; how we prioritize it, design it, develop it, integrate it, and consume it.\r\n\r\nAndrew is a Principal Architect helping to change construction management at Buildertrend Inc. He resides in Omaha, Nebraska.",
    "title": "Design systems from the other side: understanding the value for non-designer roles.",
    "description": "Design systems are something that many design teams are pushing for within software platforms and products. On the surface, the term sounds like something great for designers. But what's the value in it for other technical roles?\r\n\r\nAfter demystifying the term \"design system\", we'll dive into the differences in day-to-day life with the developer, quality assurance, and product owner roles. I'll discuss some of the responsibilities that non-designer roles typically have as part of a well-implemented design system. If your company's software doesn't yet have an intentional design system, I'll talk through some great starting spots for designers and non-designers alike.",
    "organization": "Buildertrend Inc.",
    "photoUrl": "https://secure.gravatar.com/avatar/c88f878b659d5b406c240361bba0ae5a?s=500",
    "photo": "/photos/speakers/andrew-wirick.png"
  },
  {
    "id": "chris-demars",
    "firstName": "Chris",
    "lastName": "DeMars",
    "bio": "Chris DeMars is a front end developer first, UX architect always, from Detroit, Michigan now living in Denver, Colorado. For his community contributions, he holds awards as a Microsoft MVP in developer technologies and Google Developer Expert in web technologies. He is also an international speaker and former organizer for Vuetroit and former co-organizer of the Ann Arbor Accessibility Group. Chris loves coming up with solutions for enterprise applications, which include modular CSS architectures, performance, and advocating for web accessibility. When he is not working on making the web great and inclusive you can find him writing blog posts, recording episodes of his podcast, Tales From The Script, or watching horror movies.",
    "title": "Believe in the Power of CSS",
    "description": "You know that song by Huey Lewis and the News, The Power of Love? \"First time you feel it, it might make you sad.\" Might be how you feel about CSS right? What about the power of CSS? CSS has received a bad name as of late, but truth of the matter is that CSS is such a powerful piece of the front-end puzzle and you should really be excited for what's already here and what's to come! Who would have thought we could create magazine-style layouts with CSS grid? What about ruleset variable scoping with custom properties(CSS variables)? And last but not least, the pain of centering content horizontally and vertically which is now possible in three lines with flexbox! Let's talk about how awesome CSS is, and how we can restore our faith in one of the best things that makes the web amazing!",
    "organization": "Tuft & Needle",
    "photoUrl": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/4238/Headshot-4.jpeg",
    "photo": "/photos/speakers/chris-demars.png"
  },
  {
    "id": "cassandra-faris",
    "firstName": "Cassandra",
    "lastName": "Faris",
    "bio": "Cassandra Faris is passionate about the human side of technology. She is the Community Manager at SaltStack, an event-driven security, cloud, and configuration management software company. Her career has focused on supporting tech professionals through training, community outreach, marketing, hiring, mentoring, and employee engagement. She is an international speaker who specializes in teaching people how to communicate, be more effective team members, and advance their careers.  She President of the Stir Scholarship for high school girls pursuing technology careers and President Emeritus of the DogFoodCon tech conference. She has an MBA in Organizational Leadership. When she's not busy with the tech community, she is an avid tabletop gamer, runner, and soccer fan who travels as much as possible.",
    "title": "Get Out of Your Lane!",
    "description": "In the tech industry, we often think our jobs have narrowly defined skillsets. We believe that staying in our lanes, gaining more years of experience, and learning new technical skills yields automatic career growth. This is a mistake! For continual career growth, we must also venture into the worlds of business and communication. This talk will explain why these worlds matter to your career. You’ll discover how to gain and apply this knowledge through hands-on exercises and discussion. You’ll also learn how leveraging the tech community enhances your business and communication skills alongside your technical skills. This session will leave you challenged to go beyond your job description and drive your career forward.",
    "organization": "SaltStack",
    "photoUrl": "https://secure.gravatar.com/avatar/b1701edf89eb84687a4c41f0d3161f07?s=500",
    "photo": "/photos/speakers/cassandra-faris.png"
  },
  {
    "id": "christiana-unaeze",
    "firstName": "Christiana",
    "lastName": "Unaeze",
    "bio": "Christiana Unaeze is a User Experience Designer, Entrepreneur and Visual Design Strategist. She has over a decade of combined experience in visual and user experience design, project management and design consulting. Currently, Christiana is a consultant with a federal agency where she leads and supports design and accessibility efforts on multiple projects. She is on a mission to help design products that are engaging, creative and accessible to all. She is also a runner, an avid reader, a Game of Thrones fan, an aficionado of statement jewelry, and a fervent DIYer.",
    "title": " Guidelines on Designing and Testing for Accessibility",
    "description": "One main goal of great user experience is creating digital products that ANYONE can use. If you are not thinking about accessibility, then you’re not thinking about the full user experience. Ideally, the user experience for everyone should be the same regardless of physical or cognitive limitations. This means addressing user accessibility scenarios from the onset. Accessibility makes it possible for people with disabilities to understand and navigate well designed digital products. However, accessibility is often one of the last things addressed in product and software design. These guidelines will cover some of the major factors to address and test for in order to meet the accessibility standards in the Web Content Accessibility Guidelines (WCAG). ",
    "organization": "",
    "photoUrl": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/44361/ChristianaUnaeze_ProfilePic.jpg",
    "photo": "/photos/speakers/christiana-unaeze.png"
  },
  {
    "id": "adrienne-tacke",
    "firstName": "Adrienne",
    "lastName": "Tacke",
    "bio": "Adrienne Braganza Tacke is a Filipina software engineer, international speaker, and published author of the book Coding for Kids: Python. She is also a LinkedIn Learning instructor who specializes in Azure and Cloud Development courses. She takes great delight in solving complex problems and building awesome things, particularly with C# and JavaScript. Most of all, she relishes the opportunity to teach anyone about code.",
    "title": "Testing the Functional Waters: Functional Programming Principles and Patterns in C#",
    "description": "Originating as a C# developer, the benefits of functional programming always taunted me. Yet, most applications I worked on heavily relied on user interfaces and an otherwise object-oriented architecture, so the decision to move to F# or some other functional programming language didn't make sense. \r\n\r\nDespite this, many principles and patterns from functional programming DID make sense to implement for cleaner and more robust code. Important paradigms like immutability, method chaining, and using expressions over statements were certainly things even C# developers could take advantage of! In this talk, I want to demonstrate how C# developers can implement these beneficial patterns and principles and explore how doing so ultimately results in better code!\r\n\r\n",
    "organization": "Self-Employed",
    "photoUrl": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/38211/atacke-headshot-md.jpg",
    "photo": "/photos/speakers/adrienne-tacke.png"
  },
  {
    "id": "jeremy-wagner",
    "firstName": "Jeremy",
    "lastName": "Wagner",
    "bio": "Jeremy Wagner is a web performance consultant at SiteImprove in Minnesota who writes and speakers frequently on the web and how to make it faster for everyone, everywhere.",
    "title": "Make it Boring",
    "description": "A good case can be made for why boring is preferable to exciting in many aspects of our lives. Yet, we're reluctant to apply this sentiment to the web. Rather, we're in a relentless pursuit of the exciting in this increasingly JavaScript-centric world of web development. A pursuit that, despite our best efforts, litters the landscape of the web with excruciatingly slow and inaccessible pages. As division brews over the roles of HTML, CSS, and indeed JavaScript itself, we need to ask if it's worth making the web boring again.\r\n\r\nBut why make the web more boring? Because boring is fast, resilient, fault tolerant, and accessible. Boring is the essence of unobtrusive designs that facilitate interactions rather than hinder them. When we rely wholesale on JavaScript to build for the web, we're inevitably reinventing things—things that can hinder or even fail people in unexpected ways despite our best intentions. In this session, you'll learn why building for the web with a greater emphasis on core technologies is far from boring, but truly rewarding and exciting work that makes the web more inclusive.",
    "organization": "",
    "photoUrl": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/5977/jlwagner.jpg",
    "photo": "/photos/speakers/jeremy-wagner.png"
  },
  {
    "id": "hilary-stohs-krause",
    "firstName": "Hilary",
    "lastName": "Stohs-Krause",
    "bio": "Hilary Stohs-Krause is a full-stack software developer at [Ten Forward Consulting](http://tenforward.consulting) in Madison, WI. She came to tech by way of childhood website-building (a _\"Buffy the Vampire Slayer\"_ fansite, to be exact). Before joining Ten Forward, she spent several years as a professional radio journalist in Lincoln, Nebraska, and attended Omaha Code School.\r\n\r\nHilary volunteers regularly with several tech and community organizations, and co-runs [Madison Women in Tech](http://madisonwomen.tech), a local group with more than 1,800 members. She loves board games, garlic-stuffed olives and bourbon barrel-aged stouts. She’ll read any fantasy or sci-fi she can get her hands on.\r\n\r\nShe tweets puns and intersectional feminism at [@hilarysk](http://twitter.com/hilarysk).",
    "title": "Using our powers for good: Tech and social impact",
    "description": "Want to make a difference in your community, but don’t know how, or feel like you don’t have time?\r\n\r\nYou’re not alone. Luckily, there are a number of ways you can use your tech-industry skills to create positive change in your community - and yourself! (Fun fact: volunteers live longer and make more money than those who don’t volunteer.)\r\n\r\nWe’ll explore the why’s, how’s, and where’s for sharing our skills, both technical and non-technical. You’ll learn more about the breadth of ways to give back, and hopefully leave feeling empowered to reach out in your own community and start making connections.",
    "organization": "Ten Forward Consulting",
    "photoUrl": "https://secure.gravatar.com/avatar/cf1a104aa1d9b44fdf49658c59f4aea3?s=500",
    "photo": "/photos/speakers/hilary-stohs-krause.png"
  },
  {
    "id": "cameron-presley",
    "firstName": "Cameron",
    "lastName": "Presley",
    "bio": "Cameron Presley is a Lead Software Engineer for SentryOne (https://www.sentryone.com), a speaker, a Microsoft MVP, Director of Speaker Relations for CodeStock (@CodeStock) and co-organizer of FunctionalKnox (@FunctionalKnox).\r\n\r\nBased out of Oak Ridge, Tennesee, Cameron has ten years of experience working with start-ups and large enterprise both publicly and privately held to architect solutions, implement solutions, and training developers to be better today than what they were yesterday!\r\n\r\nIn his spare time, Cameron can be found hanging out with his family, playing board games, jamming on the bass guitar, and reading books.",
    "title": "How To Have Code Reviews Developers Actually Want",
    "description": "This phrase can stir up a lot of emotions for people. For some, it's aggravation because they're a waste of time, for others, it's stressful because it feels like you're getting a review. However, for some, it's a great learning experience that leads to the team improving. Do you want to be in the latter group? Then this talk is for you!\r\n\r\nIn this talk, we'll start by looking into the goal of code reviews and why we should be doing them. From there, I'll show you the common mistakes that teams make with code reviews and how to fix them. To wrap things up, I'll show you what I do when performing code reviews.\r\n\r\nIntended for developers of all levels, attendees will understand the reason why we should have code reviews, signs of bad reviews, signs of good reviews, and have some ideas to take back with them.",
    "organization": "SentryOne",
    "photoUrl": "https://secure.gravatar.com/avatar/b83400da358894a0dde39a26d69a73d1?s=500",
    "photo": "/photos/speakers/cameron-presley.png"
  },
  {
    "id": "arthur-doler",
    "firstName": "Arthur",
    "lastName": "Doler",
    "bio": "Arthur (or Art, take your pick) has been a software engineer for 16 years and has worked on things as exciting as analysis software for casinos and things as boring as banking websites. He is an advocate for talking openly about psychology and mental health in the technical world, and he spends a lot of time thinking about how we program and why we program, and about the tools, structures, cultures, and mental processes that help and hinder us from our ultimate goal of writing amazing things. His hair is brown and his thorax is a shiny blue color.",
    "title": "An AI with an Agenda: How Our Biases Leak Into Machine Learning",
    "description": "In the glorious AI-assisted future, all decisions are objective and perfect, and there’s no such thing as biases. That’s why we created AI and machine learning, right? Because humans can make mistakes, and computers are perfect. Well, there’s some bad news: humans make those AIs and machine learning models, and as a result humanity’s biases and missteps can subtly work their way into our AI and models.\r\n\r\nAll hope isn’t lost, though! In this talk you’ll learn how science and statistics have already solved some of these problems and how a robust awareness of cognitive biases can help with many of the rest. Come learn what else we can do to protect ourselves from these old mistakes, because we owe it to the people who’ll rely on our algorithms to deliver the best possible intelligence!",
    "organization": "Aviture",
    "photoUrl": "https://secure.gravatar.com/avatar/6f6662ecab8176c54c3ad89ec158842c?s=500",
    "photo": "/photos/speakers/arthur-doler.png"
  },
  {
    "id": "jennifer-blatz",
    "firstName": "Jennifer",
    "lastName": "Blatz",
    "bio": "Jen Blatz is a Lead User Experience Designer and Researcher with expertise that lends itself to any industry. Jen's path to UX started in journalism and graphic design where she learned the importance of aesthetics, organization, and catering content for the consumer. She has worked in a number of fields including finance, cloud storage, security and pet health. Jen is now at Fidelity Investments focusing on improving enterprise tools used by employees.\r\nJen loves being active in the UX community to learn and grow while helping others do the same. She is the co-founder of the UX Research and Strategy group, and of IXDA (Interaction Design Association) Dallas. She is the organizer of WIAD (World Information Architecture Day) DFW in 2019 and 2020, and speaker for several local meetups and international conferences like Big Design and Concentric Conference. When not immersed in UX activities and speaking at local meetups, conferences and classes, Jen loves traveling, wine tasting, cooking and spending time with her husband and two doggos, Sadie and Ricky.\r\nLinkedIn: https://www.linkedin.com/in/jenniferblatz/\r\nWebsite: http://jenniferblatzdesign.com/\r\nDribbble: https://dribbble.com/jnblatz\r\nUX Research and Strategy group: https://uxresearchandstrategy.com\r\nTwitter: https://twitter.com@jnblatz",
    "title": "What the “F” is UX and how does it fit in to the agile world? ",
    "description": "There is a lot of confusion about UX. What is it? What’s the difference between UX and UI? How do UX folks relate to and work with developers?\r\nAnd this is just the tip of the iceberg. When the Agile Manifesto was written, UX was not a part of that world. So this brings up even more questions:\r\nHow is UX supposed to fit in to our company’s agile model?\r\nShould UX be part of our agile ceremonies and sprints? How is this all supposed to work. This talk will clarify the mustery of what User Experience is and how to incorporate it in to agile and sprints. \r\n\r\nOutline\r\n•\tDefine UX\r\no\tWhat UX is and is not\r\no\tThe benefits of UX\r\no\tDemystifying the UX and user-centered design process\r\no\tWhat a UX designer actually does\r\no\tValue of user research\r\no\tHow UX can make a developer’s life easier\r\n•\tUX in Agile\r\no\tAgile Manifesto’s principles and how they relate to UX \r\no\tPlanning ahead\r\no\tTimeline and sprints\r\no\tWorking on the team, we’re not a “developer”\r\no\tCollaboration in person and remotely\r\no\tDon’t throw it over the wall\r\n",
    "organization": "Fidelity Investments and UX Research and Strategy group",
    "photoUrl": "https://secure.gravatar.com/avatar/3a2cfecc1ca3f8a4d69ba800a94c290f?s=500",
    "photo": "/photos/speakers/jennifer-blatz.png"
  },
  {
    "id": "alison-hawke",
    "firstName": "Alison",
    "lastName": "Hawke",
    "bio": "I'm the director of quality advocacy for World Wide Technology, serving a team of over forty testers in five cities. My goal is to write code that breaks code to make a better product for the user. I train technical testers who can help a team release awesome products that make client's lives better. I've been in QA since 2005 and I love getting into the code to test more thoroughly. I've written test code in Java, C#, JavaScript, and Elixir. Outside work, I'm a black belt in Chinese Kenpo and have fun sparring every week. I also knit a lot of hats. Originally from England.",
    "title": "Building a QA practice from scratch",
    "description": "When you're the only QA, how do you build a quality assurance practice?  Thinking about recruiting, training, fun, multiple remote offices, delegation, velociraptor-avoidance techniques, staffing, snacks, blood, sweat, and tea. I'll share the potholes we fell into so you can fall in different ones.",
    "organization": "World Wide Technology",
    "photoUrl": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/14941/KCDCportraits0241_lower_quality_and_small.jpg",
    "photo": "/photos/speakers/alison-hawke.png"
  },
  {
    "id": "duane-newman",
    "firstName": "Duane",
    "lastName": "Newman",
    "bio": "Duane is Co-Founder of Alien Arc Technologies, LLC where he focuses on creating apps targeting mobile devices, modern desktops, and the Internet of Things. As a Microsoft MVP and technology enthusiast with a passion for good software he strives to bring solutions that improve or eliminate costly duplication and repetitive processes so more important things can be done. He enjoys teaching others and speaking at conferences on topics ranging from DevOps to Xamarin. When not behind a computer screen he can be found sharing his love of SCUBA and all things underwater with new divers at the pool or through his underwater videos and photos at DLDAdventures.com.",
    "title": "Unit-Testing With Ease",
    "description": "Do you want to skip all the setup ceremony and get straight to the actual testing when writing unit tests? Leveraging dependency injection and IoC makes it a breeze to build solutions that are modular and testable, but building out those dependency chains in our unit tests can leave them cluttered and overly complex. It's time to learn to embrace the magic of IoC, DI, and mocking to lower the friction of writing and maintaining unit tests. Taking cues from the open-source library Ease, you can see how to tap into the life-cycle of unit testing frameworks and integrate it with an IoC container to give you a fresh start for each test. Throw in a little mocking and a flexible pattern for managing setup and now you are testing in high gear! A great side-effect of using Ease, or a similar methodology, is that tests become more resilient against changes in the dependencies that are not a direct concern of the test, so you end up breaking fewer tests and changing less test code. What are you waiting for? Stop the ceremony, and start testing!",
    "organization": "Alien Arc Technologies, LLC",
    "photoUrl": "https://secure.gravatar.com/avatar/993158fc3d5564fab480c586ffe67d27?s=500",
    "photo": "/photos/speakers/duane-newman.png"
  },
  {
    "id": "amanda-perkins",
    "firstName": "Amanda",
    "lastName": "Perkins",
    "bio": "I've been a QA for 7 years now and I try to use my varied job skills to help improve not only software quality but the quality of interactions with my team. I have a background in customer service and music and feel that these skills help me to think outside the box when it comes to quality. I am currently pursuing my degree in Leadership at Norwich University and feel that the additional skills I’m learning there will help me take QA even further.\r\n",
    "title": "Travels through the Looking Glass: My journey from Customer Service rep to Automation Test Engineer",
    "description": "The road we travel in our jobs (and our lives) is not always smooth, but sometimes, it takes falling down the rabbit hole to lead you on the yellow brick road to your very own Oz.  It doesn't matter where you start; it's about where you end up.  Using pop culture references, we'll discuss the journey I took to get from Customer Service Rep where my understanding of IT was a couple people in a closet like office to working as a QA in a waterfall software shop for a university to Automation Test Engineer and Lead QA.  I want to share my experience with others to show that we've all traveled down different roads but our experiences and knowledge shape how and what we test as we're testing, from how we interact with a mobile app to how we test that new website to how we write up a bug ticket.  Everything we’ve done before comes with us into testing, and it’s what shapes us to do what we do best! ",
    "organization": "NIC",
    "photoUrl": "https://secure.gravatar.com/avatar/a09443547f25a7410f8b111ad7269fd4?s=500",
    "photo": "/photos/speakers/amanda-perkins.png"
  },
  {
    "id": "scott-connerly",
    "firstName": "Scott",
    "lastName": "Connerly",
    "bio": "I love leading dev teams, both technically and interpersonally. I've been head of Engineering for 2 years, an Architect for 4 years, and an IC for 11 years. Domains include Healthcare, Non-Profits, Education, and Advertising. A vocal advocate of Agile principles. FILDI like Ze Frank.",
    "title": "Everything's an Experiment: the Try/Catch for Teams",
    "description": "Google's Project Aristotle helped quantify the value of psychological safety on a team, but how do you actually achieve it? Of all the values that support psychological safety, trust is the most foundational. But how do you build trust, especially in situations where people have been burnt before? Just like in building technology, iteration and experimentation can get us there. In this talk I explore when team experiments are useful, how to structure them, how to manage expectations around them. and I'll share stories of my own experiments and how they've panned out.",
    "organization": "aware3",
    "photoUrl": "https://secure.gravatar.com/avatar/935ee156ea847441833a1a32bb803284?s=500",
    "photo": "/photos/speakers/scott-connerly.png"
  },
  {
    "id": "joel-tosi",
    "firstName": "Joel",
    "lastName": "Tosi",
    "bio": "Coaching and pairing within and across teams on how to leverage new technologies to drive product learning.",
    "title": "Growing a Learning Organization ",
    "description": "This session is an evolution of our talks around growing Dojos (though awareness of dojos is not necessary for this talk).\r\n\r\nIn this session we will look at the challenges facing organizations and people today trying to learn new skills (committment, context, multitude of needs).\r\n\r\nFrom there we will look at how we learn exploring explicit vs tacit knowledge. \r\n\r\nWe will wrap up with tangible ways you can start growing an organization that continuous learns - looking at addressing the whole value stream to provide context and growing an organization that has internal coaches and teachers (along with models for that).",
    "organization": "Dojo & Co",
    "photoUrl": "https://secure.gravatar.com/avatar/a575aa486aa37fcb5cab5646110f721a?s=500",
    "photo": "/photos/speakers/joel-tosi.png"
  },
  {
    "id": "chris-chung",
    "firstName": "Chris",
    "lastName": "Chung",
    "bio": "My passion is coaching and mentoring individuals of all software backgrounds from product teams to infrastructure and operations.  I get energized by working one-on-one or in teams on problems that seem complex from an organizational change management stance, but are really simple.  It's important to me to channel my energy in the events that will help grow the skills of others because only then can they help the whole group move forward. ",
    "title": "Secret Backlogs",
    "description": "Across the five fundamental events of scrum, each has a varying degree of maturity and success.  This session looks to introspectively analyze how backlog grooming, planning, standup, demo, and retro are powerful team building and culture tools but how our previous experiences have shaped them into something else entirely.  Themes of \"Secret Backlogs\", \"Place Holder Planning\", \"Sit-down Stand-ups\", \"Lack of Demos\", and \"Touch-and-Go Retro\" are indications of areas where team members need to coaching and support to become high performing again. ",
    "organization": "Spreetail",
    "photoUrl": "https://secure.gravatar.com/avatar/e7ad87163b9b3beb364fc9a230486b78?s=500",
    "photo": "/photos/speakers/chris-chung.png"
  },
  {
    "id": "bill-dinger",
    "firstName": "Bill",
    "lastName": "Dinger",
    "bio": "Bill is a Senior Technical Lead with Americas working on delivering digital solutions to our clients. Over the last 17 years Bill has worked in enterprise IT starting in the trenches on the help desk. After that, Bill spent almost a decade working in infrastructure support focusing in the Microsoft stack. Over the last 5 years Bill has been developing, architecting and leading teams of software developers. During his 16 years Bill has done everything from troubleshoot dial up connections in rural Nebraska to building the digital experiences for some of America's most well known brands.\r\n\r\nWhen not working, Bill will probably be found on his bike exploring gravel roads in his hometown of Lincoln, Nebraska.",
    "title": "The Dungeon Master's Guide to DevOps",
    "description": "We'll go over the full CI/CD cycle: builds, commit hooks, static code analysis, pull request review tools, automated linting, QA/Security/Release automation and build automation. Gained from years of practical experience I’ll share what has worked best on projects cross industry and from teams ranging for 2 to 140.",
    "organization": "Ameritas",
    "photoUrl": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/10268/os0c8042.jpg",
    "photo": "/photos/speakers/bill-dinger.png"
  },
  {
    "id": "courtney-heitman",
    "firstName": "Courtney",
    "lastName": "Heitman",
    "bio": "Courtney's passion for the web all started with teaching her 11-year-old self how to write CSS on a dial-up internet connection on a farm in rural Iowa. Since then she has been in a myriad of positions including a Flash developer for several higher ed institutions, a Joomla developer, a brief stint as a server admin, a designer, a full stack developer, and a project manager. Currently, Courtney is a UX Developer, Scrum Master, and Accessibility Compliance Specialist for Gallup in Omaha, Nebraska. Her passion is making a web that is usable and accessible to all.",
    "title": "The Dark Side of UX",
    "description": "User experience design brings clarity, removes obstacles. It rewards - makes us feel accomplished, successful, happy. Users are confident when using a well-designed application - as easy as turning on a light switch: [Buy]\r\n\r\nDon't make me think: did I opt in? Don't make me think: was that a hidden fee?\r\n\r\nWe will explore the wild world of user manipulation. The Bait and Switch. Trick Questions. Misdirection. Confirm-shaming! Discover the latest ways UX designers trick their users, how easy it is to do by accident and how it affects your brand.\r\n\r\n[ Sounds great ] [ No, I hate knowing things ]",
    "organization": "Gallup",
    "photoUrl": "https://secure.gravatar.com/avatar/dbb90a82ca9a474e21ad5372fdb2b71e?s=500",
    "photo": "/photos/speakers/courtney-heitman.png"
  },
  {
    "id": "sandi-barr",
    "firstName": "Sandi",
    "lastName": "Barr",
    "bio": "Sandi's passion for software development has grown over the years as she has witnessed its potential for improving people's lives. Having seen that technology can be both a barrier to entry and a gateway to opportunity, she has worked in her local community to provide tech education to folks who may not otherwise have access. She's held NodeSchool and Django Girls workshops, is an organizer for NEJS Conference, and worked with organizations to create a sense of belonging for those who are underrepresented in tech.",
    "title": "Design Thinking for Inclusive Collaboration",
    "description": "How can Design Thinking help us build more collaborative and inclusive teams? The process involves seeking out diverse perspectives to better understand user needs. This reduces the impact of our cognitive biases, which then also helps to find alignment across differences and leads to more creative solutions. It changes the conversation by reframing the problem around user-driven criteria. Design Thinking involves and values all team members throughout the process and results in building the best solution for our users. As we walk through the process step-by-step, attendees will gain insights they can leverage to introduce a design thinking mindset within their organization and learn how it can be used as a tool to collaborate effectively within and across teams.",
    "organization": "PRX",
    "photoUrl": "https://secure.gravatar.com/avatar/40b13a365c9d251119637cb8c17f61a2?s=500",
    "photo": "/photos/speakers/sandi-barr.png"
  },
  {
    "id": "christine-seeman",
    "firstName": "Christine",
    "lastName": "Seeman",
    "bio": "Christine is from Omaha, Nebraska where she works as a full stack Ruby on Rails engineer at Flywheel, Delightful Wordpress Hosting for Creatives. She has 12 years experience as a Java engineer with a focus on APIs, testing, and micro-services (before they were cool). Then to change it up, she took the plunge into Ruby in 2018. In her spare time she is an avid reader, huge Rush fan and is attempting to work through the primary Ashtanga yoga series. ",
    "title": "You don’t know ML and neither do we",
    "description": "But that’s fine, Google does! Google Cloud Vision AI is an approachable collection of deep learning algorithms that enables high quality visual analysis on any application.  But will the actual analysis meet your expectations? Finding millions of images to put Cloud Vision through its paces is just an Instagram away. With both Cloud Vision and Instagram in combination, this talk will show the highs and lows of using this advanced imaging technology, no data science degree required.",
    "organization": "Flywheel",
    "photoUrl": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/37780/christine_square_purple.png",
    "photo": "/photos/speakers/christine-seeman.png"
  },
  {
    "id": "ash-banaszek",
    "firstName": "Ash",
    "lastName": "Banaszek",
    "bio": "Ash Banaszek is a passionate and outspoken UX advocate at Union Pacific Railroad with nearly a decade of experience in the field. She holds a masters of science in information science from Missouri University of Science and Technology in Rolla, MO and returns to her alma mater regularly to guest lecture in human factors and human-computer interaction courses.  Ash has a passion for teaching and getting folks to that \"ah-hah\" moment about UX. As an avid proponent of creating technology people want to use, Ash's eternal quest is to destroy technology that gets people so frustrated that they want to chuck it out of a window. Outside of righting tech wrongs, Ash is an award-winning Toastmaster and uses her public speaking experience to infuse humor and thought-provoking questions into her talks. You can follow her on Twitter @ashbzak or linkedin.com/in/ashmb, or meet in person for lively conversation at a UX Happy Hour Book Club Meetup in Omaha, NE.",
    "title": "Fail Faster: Quick UX Design Techniques to Drive Toward Success",
    "description": "Learn simple and paradigm shifting design techniques from Senior UX Professional Ash Banaszek.  This talk comes from hearing folks exasperated from making their project deadlines and budgets, only to fail with users upon launch. A lot of times, this has to do with missed requirements and a stubborn conviction to stick to a plan even if the design is untested. Ash will share with you the design techniques used to create effective user interfaces through sketching, mind stretching, and iteration.  Further, you'll learn how to conduct black hat sessions to shake out missed requirements, mismatched UI expectations, and get much needed buy in from project stakeholders.\r\n\r\nWith a world that wants everything faster and faster, Ash will give you simple techniques that make a big difference; thus enabling you to think through multiple solutions, get yourself un-stuck from a single idea, iterate on your designs, and rally your team around this process. \r\n\r\nReady, get set, FAIL!.. The faster you fail, the faster you can succeed.",
    "organization": "Union Pacific",
    "photoUrl": "https://secure.gravatar.com/avatar/5971f39048d78e6e75c3d38cee1e9008?s=500",
    "photo": "/photos/speakers/ash-banaszek.png"
  },
  {
    "id": "charlie-koster",
    "firstName": "Charlie",
    "lastName": "Koster",
    "bio": "Charlie is a Tech Lead who enjoys finding and exploring disruptive ideas and technology. Elm, Genetic Algorithms, Augmented Reality, more. He passionately and empathetically builds software while sharing with others what he learns through blog posts and conference talks.",
    "title": "The Side Project Survival Guide",
    "description": "Have you ever been highly motivated to work on a side project only to see that project not survive its first weekend? There are many reasons side projects don't survive such as intimidating complexity, scope creep, or an attention shift to a shiny new tech. In this talk I'll explain not only how to keep your side project from dying but also the importance of completing side projects for your career and future opportunities.",
    "organization": "NoRedInk",
    "photoUrl": "https://secure.gravatar.com/avatar/61b138e5973bfc130abda203233203b6?s=500",
    "photo": "/photos/speakers/charlie-koster.png"
  },
  {
    "id": "jeff-strauss",
    "firstName": "Jeff",
    "lastName": "Strauss",
    "bio": "Jeff is a technical architect, an executive consultant, and an attorney. As a member of the Chief Digital Advisor team at World Wide Technology—and with his unique experiences that combine tech and the law—he maintains a passion for solving problems with inspired solutions, improving life and business through technology.\r\n\r\nA dedicated member of the developer community, Jeff travels internationally to speak on both technical and business-oriented topics. He is a Microsoft MVP and serves on the board of directors for the Kansas City Developer Conference.",
    "title": "What You Need to Know About Open Source—Trust Me, I'm a Lawyer",
    "description": "Open source tools. We all use them. Whether an entire framework, a focused toolkit, or a simple custom component from GitHub, npm, or NuGet, the opportunity to improve our development speed while learning new things from open source projects is enticing.\r\n\r\nBut what does “open source” truly mean? What are our rights and limitations as open source consumers to use, modify, and redistribute these tools in a professional environment? The answer depends upon the OSS author's own decisions regarding project licensing. Come investigate the core principles of open source development and consumption while comparing and contrasting some of the more popular licenses in use today. Learn to make better decisions for your organization by becoming informed of how best to leverage the open source works of others and also how to properly license your own.",
    "organization": "World Wide Technology",
    "photoUrl": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/8809/JeffStrauss_SpeakerAvatar.jpg",
    "photo": "/photos/speakers/jeff-strauss.png"
  },
  {
    "id": "jonathan-mills",
    "firstName": "Jonathan",
    "lastName": "Mills",
    "bio": "Jonathan is a Pluralsight Author, Technology Advisor, and Business Leader. As a member of the Chief Digital Advisory team at World Wide Technology, Jonathan is able to leverage his unique experiences and skills to drive digital transformation for his clients. \r\n\r\nAs a dedicated developer community leader, Jonathan serves on the board of directors for the Kansas City Developers Conference, Microsoft MVP, and is a regular speaker and keynote presenter at conferences around the globe.",
    "title": "A Skeptics guide to functional style javascript",
    "description": "With modern JavaScript, we have seen a rise in ‘functional style’ javascript popularity. This style introduces a whole slew of terms and patterns that have different connotations depending on who you are talking to. Phrases like purity, higher order functions, and currying are thrown around all over the place. What does ‘no side effects’ mean, and what about when you need to get something done? And what in the world is a ‘monad’? In this talk, Jon will walk through the world of the functional programmer and show how these phrases and patterns fit into modern JavaScript development. Jon will work through functions as first class objects in JS, and show how we can use that feature to write clean, maintainable, and reusable code. You will also walk away armed with the information you need to see through all they hype. You’ll have a firm grasp of where these patterns are useful, and as importantly, where they are not.",
    "organization": "Epiq Global",
    "photoUrl": "https://secure.gravatar.com/avatar/c61c005551e69d15054f26b9bed32b81?s=500",
    "photo": "/photos/speakers/jonathan-mills.png"
  },
  {
    "id": "kathy-i-andersen",
    "firstName": "Kathy I.",
    "lastName": "Andersen",
    "bio": "Kathy serves as a Scaled Scrum Master at Hudl. There, she has the honor of working with talented teams and individuals supporting the \"business\" side of the Hudl's efforts to market, sell, support, and report on the company's products and services.\r\n\r\nKathy took an uncommon route to the software world, from running a nonprofit to seeing how startups fit into the landscape of economic development to grasping the magic of product development. Since then, she has worked on a host of different software projects and engineering teams. On one of her early projects, she ramped up on scrum and agile and fell in love with the idea that there really are ways to do work well.\r\n\r\nToday you'll find her speaking at conferences and participating in the agile & product development communities.",
    "title": "Diamonds in Our Own Backyard: Building Great Development Teams at Hudl",
    "description": "Successfully developing and retaining skilled engineers, designers, and product people is make-or-break for companies large and small. Hudl has grown fast and done well in that arena: today over 250 development team members ply their trade at the company, building video and analysis tools for sports teams around the world.\r\n \r\nOne key to Hudl's success is apprenticeships, where anyone in the company can apprentice in a new role. The apprenticeship program has evolved over many years to become an adaptable, decentralized, and finely-tuned framework. We found that apprenticeships not only drive employee career growth; they also build a more robust and diverse workforce as a whole. This model is part of the big picture of talent pipelines in the Midwest and beyond, where making smart investments in human capital means we’re tapping into “diamonds in our own backyard.”\r\n \r\nThis talk shows the How, the Who, and the Why of Hudl’s apprenticeship program, told via individual narratives and product team outcomes.",
    "organization": "Hudl",
    "photoUrl": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/10286/2018-12-13_head_shot_kathyia_square.jpg",
    "photo": "/photos/speakers/kathy-i-andersen.png"
  },
  {
    "id": "cory-house",
    "firstName": "Cory",
    "lastName": "House",
    "bio": "Cory is a Pluralsight author, Microsoft MVP, Software Architect, independent consultant, and international speaker. He has trained over 100,000 software developers worldwide on clean coding practices, front-end development, testing, and software architecture. He currently specializes in ASP.NET, JavaScript and front-end development using React. Cory is author of multiple Pluralsight courses and is active on Twitter as @housecor.",
    "title": "Software (and Life): You Can’t Change Just One Thing",
    "description": "Black and white is easy. But software and life are shades of gray. We want lightning fast performance, rock solid security, comprehensive test coverage, and a polished user experience. Yet every choice we make has unintended, and often undesirable consequences. This session is a revealing tale of my lessons learned from 15 years of exploring extremes in software…and life. \r\n",
    "organization": "ReactJSConsulting.com and Pluralsight",
    "photoUrl": "https://secure.gravatar.com/avatar/09e16ce7b4bc21025c9940f5a167cfa9?s=500",
    "photo": "/photos/speakers/cory-house.png"
  }
]
