[
    {
        "id": "john-henry-muller",
        "firstName": "John Henry",
        "lastName": "Müller",
        "bio": "John Henry Müller is a Design Director at Hudl, a sports technology software used by teams around the world (including Premier League, NBA, NHL, NFL, NCAA, and 98% of high school football teams). At Hudl, he focuses on visual design spanning both product and brand design, with a team of over 30 designers. John Henry led the visual direction of Uniform, Hudl's design system.\r\n\r\nBefore Hudl, John Henry was the design cofounder of a startup called Pack. Before that, he founded a design/dev consultancy called What Cheer, with clients including Squidoo, Hayneedle, Union Pacific Railroad, US Department of Energy and Saddle Creek Records. John Henry lives in Benson, Omaha, Nebraska with his wife, daughter, dog and two cats. He sits on the board of Big Omaha and Maha Music Festival. He was gluten-free before (and after) it was cool.",
        "title": "From Color Palette to Color System",
        "description": "Color touches literally every pixel of digital products. That's why it is so important to get color right in a design system.\r\n\r\nIn this talk, John Henry Müller (Design Director at Hudl) divulges mistakes made and practical lessons learned about color while creating Uniform, Hudl's design system.\r\n\r\nWhat you'll learn:\r\n\r\n* Tips and tricks creating a durable color scheme \r\n* Common pitfalls when defining a color palette\r\n* Understand color contrast for accessibility ",
        "photo": "/photos/johnHenry.jpg",
        "organization": "Hudl"
    },
    {
        "id": "beth-laing",
        "firstName": "Beth",
        "lastName": "Laing",
        "bio": "Beth grew-up in online journalism, working with newspaper companies in Atlanta, GA, San Jose, CA and Saint Paul, MN with a detour to work for an internet start-up, Infonautics, in Philadelphia, PA along the way.  After leaving the world of newspapers, Beth worked as a project manager for several organizations focused on the intersection of news, society and technology. In 2015 she transitioned into software development with the help of a full immersion bootcamp. As one of the directors for Women Who Code's Atlanta chapter, Beth works to create great programming and build community for the amazing women in technology of Atlanta.  She is passionate about making technology a welcoming community for everyone and breaking down barriers. Beth works as a software developer at CNN/Turner on a variety of projects for internal customer. She spends a lot of time figuring out why things don't work and how to fix them!\r\n\r\n",
        "title": "You're Hired! Avoiding missteps and false starts in your new job",
        "description": "Congratulations on your new job... now what! Starting a new job, especially if it’s your first one, is always exciting... and stressful. Here’s how to take control of the situation and make sure that you’re ready to start strong from day one. As superficial as it sounds, you want to look your best when you are meeting so many people for the first time. But you should dress appropriately for your environment - a suit would be out of place in most technical organizations. The what not to wear part is easy… but what should you wear? Getting the people part right is key.First, ask a lot of questions. Use the 70/30 rule -- ask questions 70% of the time and share your stories and ideas 30% of the time. This is your chance to learn about the company, your project and the people that you will be working with, so you want to spend most of your time listening. Be ready with a plan for getting up-to-speed, even if all the parts are not in place when you start. Chances are your accounts and access might not be fully functional from day one, so be ready with things to do in the meantime. You’ll leave with a checklist of things to do so you walk in the door on day one ready to go.",
        "photo": "/photos/bethLaing.jpg",
        "organization": "Women Who Code, Atlanta"
    },
    {
        "id": "courtney-heitman",
        "firstName": "Courtney",
        "lastName": "Heitman",
        "bio": "Courtney's passion for the web all started with teaching her 11-year-old self how to write CSS on a dial-up internet connection on a farm in rural Iowa. Since then she has been in a myriad of positions including a Flash developer for several higher ed institutions, a Joomla developer, a brief stint as a server admin, a designer, a full stack developer, and a project manager. Currently, Courtney is a UX Developer, Scrum Master, and Accessibility Compliance Specialist for Gallup in Omaha, Nebraska. Her passion is making a web that is usable and accessible to all.",
        "title": "Mapping the User's Journey",
        "description": "Do you feel like you don't actually know your users? Do they struggle through the flow of your website, and you don’t know why? \r\n\r\nThis session will introduce you to empathy mapping, and how it will help you to relate to your users better. Once we have some empathy (mapping), we'll go over user journey mapping, so we can better understand what questions and pain points our users are having as they move through our site.",
        "photo": "/photos/courtneyHeitman.jpg",
        "organization": "Gallup, Inc."
    },
    {
        "id": "jon-mills",
        "firstName": "Jonathan",
        "lastName": "Mills",
        "bio": "Jon is a Pluralsight author, Microsoft MVP, and international speaker focusing on JavaScript both in the browser and on the server.  Jonathan Mills is a JavaScript and Node.js expert working in the mean stack with individuals and companies to help build their technical skills to cope with the constantly changing landscape of software development. ",
        "title": "",
        "description": "",
        "photo": "/photos/jonMills.jpg",
        "organization": "Epiq Global"
    },
    {
        "id": "jeff-strauss",
        "firstName": "Jeff",
        "lastName": "Strauss",
        "bio": "Jeff is a software developer, an entrepreneur, and an attorney. As a consultant at WWT Asynchrony Labs, with unique experiences that combine technology and law, he maintains a passion for solving problems with inspired solutions, improving life through technology. A dedicated member of the developer community, Jeff travels internationally to speak on both technical and business-oriented topics. He is a Microsoft MVP and enjoys serving on the board of directors for the Kansas City Developer Conference.",
        "title": "",
        "description": "",
        "photo": "/photos/jeffStraus.jpg",
        "organization": "World Wide Technology"
    },
    {
        "id": "michael-perdunn",
        "firstName": "Michael",
        "lastName": "Perdunn",
        "email": "mkperdunn@gmail.com",
        "bio": "Michael Perdunn is a project manager, speaker, and consultant. He has a Master’s degree in Communication and brings over 12 years of experience managing projects in various sectors. Currently, he is consulting helping companies them transform their cybersecurity effectiveness. He is also an instructor in Information Systems and Quantitative Analysis at the University of Nebraska at Omaha.\r\n",
        "title": "What can Escape Rooms teach us about Cybersecurity?",
        "description": "The popularity of Escape Rooms have exploded. In the past four years, they have grown by an astounding 1000%. The premise is simple, a group has 60 minutes to search for clues, put those clues together correctly to solve puzzles, and successfully escape. When Cybersecurity teams respond to an incident, they have a limited amount of time to search through alerts and logs to find clues, put them together correctly to determine the impact, and respond successfully defend to their company from breach. Given the stress of the situation, many teams make mistakes and fail. Applying some simple principles, incident response can be dramatically improved. This interactive presentation will guide participants through the theory behind games such as escape rooms and the proven techniques for solving them. Then we will apply those to Cybersecurity teams through some great stories of incident response success and failures.",
        "photo": ""
    },
    {
        "id": "alison-hawke",
        "firstName": "Alison",
        "lastName": "Hawke",
        "email": "quantumtea@gmail.com",
        "bio": "I'm the director of quality advocacy for WWT Asynchrony Labs, serving a team of over forty testers in five cities. My goal is to write code that breaks code to make a better product for the user. I train technical testers who can help a team release awesome products that make client's lives better. I've been in QA since 2005 and I love getting into the code to test more thoroughly. I've written test code in Java, C#, JavaScript, and I am currently learning Elixir. Outside work, I'm a black belt in Chinese Kenpo and have fun sparring every week. I also knit a lot of hats. Originally from England.",
        "organization": "WWT Asynchrony Labs",
        "title": "A Hero's Journey: Manual Tester to Automation QA",
        "description": "**Prologue: Once Upon A Time in Software**\r\n \r\nOnce there was a project that was frustrating, it had lots of bugs and made the team unhappy. For the next project, we tried something new: the QA on the team would learn C# and she would write automated tests before the developers started coding. The team was happy, and the app runs to this day with only bugs caused by bad data the client told us could never exist. \r\n\r\nThe end. Or is it really... The Beginning?\r\n\r\nThis talk is the story of a learning quest, what I've discovered along the way teaching QAs to write test automation in Java, C#, and JavaScript, and my own journey of picking up new languages for fun, like Elixir. It is aimed at QA testers who want to broaden their testing skills, and at developers who want to help them get there. No prior coding knowledge is required for the QAs.",
        "photo": "/photos/alisonHawke.jpg"
    },
    {
        "id": "cameron-presley",
        "firstName": "Cameron",
        "lastName": "Presley",
        "email": "cameron@thesoftwarementor.com",
        "bio": "Cameron Presley is a software engineer, avid boardgamer, and Microsoft MVP living in Oak Ridge, Tennessee. He currently works for SentryOne as a software engineer focusing on improving the lives of Microsoft Data Professionals!\r\n\r\nWhen not slinging code for his day job, Cameron spends his time organizing content for the  @FunctionalKnox user group, co-organizing LambdaSquared and CodeStock conferences, and mentoring others through Code Connective.",
        "organization": "SentryOne",
        "title": "How Functional Programming Made Me A Better Developer",
        "description": "With the rise in popularity recently, functional programming has become \"The Next Big Thing\". As of today, there are tons of frameworks and tools that can be used to for front-end, back-end, desktop, and mobile development. With that being said, the majority of us are still using object-oriented languages for our day jobs and don't need to learn functional programming, right?\r\n\r\nIn this talk, I'll walk you through my experiences learning functional programming over the last year, how my style of programming has changed, and now how I think about programming with regards to both functional and object-oriented paradigms",
        "photo": "/photos/cameronPresley.jpg"
    },
    {
        "id": "arthur-doler",
        "firstName": "Arthur",
        "lastName": "Doler",
        "email": "arthurdoler@gmail.com",
        "bio": "Arthur (or Art, take your pick) has been a software engineer for 14 years and has worked on things as exciting as analysis software for casinos and things as boring as banking websites. He is an advocate for talking openly about psychology and mental health in the technical world, and he spends a lot of time thinking about how we program and why we program, and about the tools, structures, cultures, and mental processes that help and hinder us from our ultimate goal of writing amazing things. His hair is brown and his thorax is a shiny blue color.",
        "organization": "Aviture",
        "title": "How to Work with People: A Guide to Playing Nicely with Others",
        "description": "Humans. No matter what we might wish, we have to work with them to get stuff done. Unfortunately, when we join a team it doesn’t come with a manual. Figuring out how to get things done and get everyone pulling in the same direction can be a nightmare.\r\n\r\nBut it doesn’t have to be! In this example-driven talk you’ll learn what a personality type is, you’ll learn some methods for communicating better with others, and you’ll dip a toe into the psychology of team dynamics - all without having to read a huge textbook or a bunch of manager-focused books trying to sell you something. You’ll come away with tools you can use to be a better teammate and to create a stronger team, regardless of your role. Let’s get started actually working together!",
        "photo": ""
    }
]