{"path":"speakers/cassandra-faris","templateID":6,"sharedPropsHashes":{},"localProps":{"speaker":{"id":"cassandra-faris","firstName":"Cassandra","lastName":"Faris","bio":"Cassandra Faris is passionate about the human side of technology. She is the Community Manager at SaltStack, an event-driven security, cloud, and configuration management software company. Her career has focused on supporting tech professionals through training, community outreach, marketing, hiring, mentoring, and employee engagement. She is an international speaker who specializes in teaching people how to communicate, be more effective team members, and advance their careers.  She President of the Stir Scholarship for high school girls pursuing technology careers and President Emeritus of the DogFoodCon tech conference. She has an MBA in Organizational Leadership. When she's not busy with the tech community, she is an avid tabletop gamer, runner, and soccer fan who travels as much as possible.","title":"Get Out of Your Lane!","description":"In the tech industry, we often think our jobs have narrowly defined skillsets. We believe that staying in our lanes, gaining more years of experience, and learning new technical skills yields automatic career growth. This is a mistake! For continual career growth, we must also venture into the worlds of business and communication. This talk will explain why these worlds matter to your career. You’ll discover how to gain and apply this knowledge through hands-on exercises and discussion. You’ll also learn how leveraging the tech community enhances your business and communication skills alongside your technical skills. This session will leave you challenged to go beyond your job description and drive your career forward.","organization":"SaltStack","photoUrl":"https://secure.gravatar.com/avatar/b1701edf89eb84687a4c41f0d3161f07?s=500","photo":"/photos/speakers/cassandra-faris.png","room":"eb","time":"2:45"},"nextId":"charlie-koster","previousId":"cameron-presley"}}
