{"path":"speakers/katia-wheeler","templateID":4,"sharedPropsHashes":{},"localProps":{"speaker":{"id":"katia-wheeler","firstName":"Katia","lastName":"Wheeler","bio":"Katia Wheeler is a Software Engineer based in Kansas City. While growing up, she was constantly at the computer, either playing a rousing game of The Sims (let’s be honest, she was putting them all in the pool and taking away the ladder) or creating new Xanga layouts. As she got older (and Xanga faded from society), she dabbled more in the .NET space and some JavaScript frameworks.\r\n\r\nIn her current role, she focuses on managing the ReactUI on the front-end as well as some additional .NET Core API work. She has also dabbled in machine learning (Skynet), iOS and Android development, and does freelance WordPress development on the side.\r\n\r\nWhen she’s not coding, Katia can be found drinking massive amounts of coffee (seriously, ungodly amounts), biking, [attempting to blog](https://medium.com/@wheeler.katia), playing a video game, or simply maniacally laughing while stroking one of her two cats in an armchair.","title":"Thinking About React, Atomically","description":"Atomic Design is the concept of breaking down user interfaces into smaller, simpler elements. There are five different levels in atomic design: atoms, molecules, organism, templates, and pages. These levels are combined to make user interfaces.\r\n\r\nReact, at its core, follows Atomic Design inherently by encouraging developers to keep components as simple and as broken down as possible. From this simplicity, we can create more complex components and containers of components to create the user interfaces for our applications. Following these patterns gives us, as developers, an easy to manage (and test) ecosystem within our React applications.\r\n\r\nDuring this talk, we'll dive into the roots of Atomic Design and how we can apply these design principles to our React applications.","organization":"Balance Innovations","photo":"/photos/katiaWheeler.jpeg"},"nextId":"mat-warger","previousId":"kathy-i-andersen"}}
