{"path":"speakers/greg-dick","templateID":4,"sharedPropsHashes":{},"localProps":{"speaker":{"id":"greg-dick","firstName":"Greg","lastName":"Dick","bio":"I'm a Senior Engineering Team Lead at Hudl. My role as a team lead could be more accurately described as a coach. I have a passion for helping people, and I take that into my management role in form of coaching my reports to become better engineers, finding the best ways to motivate them, and providing them with authentic connections and meaningful relationships.","title":"Inverting the Management Relationship","description":"In most manager/employee relationships, the employee is a resource for the manager. The manager has a goal, something they are responsible for, and the employee is helping them to meet their goal. When it goes well, the manager is also providing feedback and coaching that helps the employee improve and grow their career. When it doesn't go well, the manager's goals trump the needs of the employee, and the employee must sink or swim. Often times, these two dynamics are at odds with each other and can even put the manager in a difficult position.\r\n\r\nAt Hudl, we took a different approach. We used a form a matrix management where managers don't typically work on the same team as their reports. We removed the delegating aspect from management, and this led to a completely different dynamic in the manager/report relationship. It actually inverted the relationship where it is now clear that the manager is a resource for the report. Our managers focus their efforts on coaching and growing the skills of their reports. Our successes are seeing our reports meet their goals. \r\n\r\nThis dynamic provides an interesting mix of pros and cons. I'll talk through those as well as the logistics of running a product team with this structure. My goal is for anyone in a more traditional org structure to start thinking about the benefits of changing up their structure.","organization":"Hudl","photo":"/photos/gregDick.jpg"},"nextId":"jason-swett","previousId":"courtney-heitman"}}
