{"path":"speakers/duane-newman","templateID":6,"sharedPropsHashes":{},"localProps":{"speaker":{"id":"duane-newman","firstName":"Duane","lastName":"Newman","bio":"Duane is Co-Founder of Alien Arc Technologies, LLC where he focuses on creating apps targeting mobile devices, modern desktops, and the Internet of Things. As a Microsoft MVP and technology enthusiast with a passion for good software he strives to bring solutions that improve or eliminate costly duplication and repetitive processes so more important things can be done. He enjoys teaching others and speaking at conferences on topics ranging from DevOps to Xamarin. When not behind a computer screen he can be found sharing his love of SCUBA and all things underwater with new divers at the pool or through his underwater videos and photos at DLDAdventures.com.","title":"Unit-Testing With Ease","description":"Do you want to skip all the setup ceremony and get straight to the actual testing when writing unit tests? Leveraging dependency injection and IoC makes it a breeze to build solutions that are modular and testable, but building out those dependency chains in our unit tests can leave them cluttered and overly complex. It's time to learn to embrace the magic of IoC, DI, and mocking to lower the friction of writing and maintaining unit tests. Taking cues from the open-source library Ease, you can see how to tap into the life-cycle of unit testing frameworks and integrate it with an IoC container to give you a fresh start for each test. Throw in a little mocking and a flexible pattern for managing setup and now you are testing in high gear! A great side-effect of using Ease, or a similar methodology, is that tests become more resilient against changes in the dependencies that are not a direct concern of the test, so you end up breaking fewer tests and changing less test code. What are you waiting for? Stop the ceremony, and start testing!","organization":"Alien Arc Technologies, LLC","photoUrl":"https://secure.gravatar.com/avatar/993158fc3d5564fab480c586ffe67d27?s=500","photo":"/photos/speakers/duane-newman.png","room":"ne","time":"2:45"},"nextId":"heather-terenzio","previousId":"courtney-heitman"}}
