{"path":"speakers/ash-banaszek","templateID":6,"sharedPropsHashes":{},"localProps":{"speaker":{"id":"ash-banaszek","firstName":"Ash","lastName":"Banaszek","bio":"Ash Banaszek is a passionate and outspoken UX advocate at Union Pacific Railroad with nearly a decade of experience in the field. She holds a masters of science in information science from Missouri University of Science and Technology in Rolla, MO and returns to her alma mater regularly to guest lecture in human factors and human-computer interaction courses.  Ash has a passion for teaching and getting folks to that \"ah-hah\" moment about UX. As an avid proponent of creating technology people want to use, Ash's eternal quest is to destroy technology that gets people so frustrated that they want to chuck it out of a window. Outside of righting tech wrongs, Ash is an award-winning Toastmaster and uses her public speaking experience to infuse humor and thought-provoking questions into her talks. You can follow her on Twitter @ashbzak or linkedin.com/in/ashmb, or meet in person for lively conversation at a UX Happy Hour Book Club Meetup in Omaha, NE.","title":"Fail Faster: Quick UX Design Techniques to Drive Toward Success","description":"Learn simple and paradigm shifting design techniques from Senior UX Professional Ash Banaszek.  This talk comes from hearing folks exasperated from making their project deadlines and budgets, only to fail with users upon launch. A lot of times, this has to do with missed requirements and a stubborn conviction to stick to a plan even if the design is untested. Ash will share with you the design techniques used to create effective user interfaces through sketching, mind stretching, and iteration.  Further, you'll learn how to conduct black hat sessions to shake out missed requirements, mismatched UI expectations, and get much needed buy in from project stakeholders.\r\n\r\nWith a world that wants everything faster and faster, Ash will give you simple techniques that make a big difference; thus enabling you to think through multiple solutions, get yourself un-stuck from a single idea, iterate on your designs, and rally your team around this process. \r\n\r\nReady, get set, FAIL!.. The faster you fail, the faster you can succeed.","organization":"Union Pacific","photoUrl":"https://secure.gravatar.com/avatar/5971f39048d78e6e75c3d38cee1e9008?s=500","photo":"/photos/speakers/ash-banaszek.png","room":"se","time":"10:15"},"nextId":"bill-dinger","previousId":"andrew-wirick"}}
