{"path":"speakers/kathy-i-andersen","templateID":6,"sharedPropsHashes":{},"localProps":{"speaker":{"id":"kathy-i-andersen","firstName":"Kathy I.","lastName":"Andersen","bio":"Kathy serves as a Scaled Scrum Master at Hudl. There, she has the honor of working with talented teams and individuals supporting the \"business\" side of the Hudl's efforts to market, sell, support, and report on the company's products and services.\r\n\r\nKathy took an uncommon route to the software world, from running a nonprofit to seeing how startups fit into the landscape of economic development to grasping the magic of product development. Since then, she has worked on a host of different software projects and engineering teams. On one of her early projects, she ramped up on scrum and agile and fell in love with the idea that there really are ways to do work well.\r\n\r\nToday you'll find her speaking at conferences and participating in the agile & product development communities.","title":"Diamonds in Our Own Backyard: Building Great Development Teams at Hudl","description":"Successfully developing and retaining skilled engineers, designers, and product people is make-or-break for companies large and small. Hudl has grown fast and done well in that arena: today over 250 development team members ply their trade at the company, building video and analysis tools for sports teams around the world.\r\n \r\nOne key to Hudl's success is apprenticeships, where anyone in the company can apprentice in a new role. The apprenticeship program has evolved over many years to become an adaptable, decentralized, and finely-tuned framework. We found that apprenticeships not only drive employee career growth; they also build a more robust and diverse workforce as a whole. This model is part of the big picture of talent pipelines in the Midwest and beyond, where making smart investments in human capital means we’re tapping into “diamonds in our own backyard.”\r\n \r\nThis talk shows the How, the Who, and the Why of Hudl’s apprenticeship program, told via individual narratives and product team outcomes.","organization":"Hudl","photoUrl":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/10286/2018-12-13_head_shot_kathyia_square.jpg","photo":"/photos/speakers/kathy-i-andersen.png","room":"se","time":"1:30"},"nextId":"matt-steele","previousId":"jonathan-mills"}}
