{"path":"speakers/patrick-wolff","templateID":4,"sharedPropsHashes":{},"localProps":{"speaker":{"id":"patrick-wolff","firstName":"Patrick","lastName":"Wolff","bio":"Patrick is passionate about collaboration, human computer interaction, graphic design and problem solving. His degree in Digital Imaging from the University of Nebraska at Omaha led him down a career path that includes television, advertising, Flash development for online learning, web development, enterprise application development, Geographic Information Systems, and leadership. Currently, Patrick serves as VP of Applications Development at Farm Credit Services of America.","title":"Grow The Future With Internship 2.0","description":"Farm Credit Services of America has a different take on what an Internship experience should be. We took the idea of an Internship, and made it AWESOME! The Intern Program is team based, and allows a small group of software development students to work together on a team along with four or five full-time mentors and leaders to create a greenfield enterprise application. The experience allows the students to iterate through the full software development life cycle in an enterprise environment: from sketching out wire-frames to deploying an enterprise application in Production. \r\n\r\nWe will also talk through how we do our intern interviews differently. Our interviews do not consist of the traditional sit-down interview with questions. We have a fun and relaxed process that let's the candidates express their creativity, collaboration, problem solving, and their personality. This helps to insure that we are investing in people that fit our culture.\r\n\r\nOne of the greatest benefits to our approach is that the students get an experience of what life is like in the real world. The amount of learning that happens when you apply the theory that's been learned in school across the entirety of the software development life-cycle in highly-collaborative enterprise team environment is indescribable. ","organization":"Farm Credit Services of America","photo":"/photos/patrickWolff.jpg"},"nextId":"paul-gower","previousId":"nicholas-tuck"}}
