{"path":"speakers/jennifer-blatz","templateID":6,"sharedPropsHashes":{},"localProps":{"speaker":{"id":"jennifer-blatz","firstName":"Jennifer","lastName":"Blatz","bio":"Jen Blatz is a Lead User Experience Designer and Researcher with expertise that lends itself to any industry. Jen's path to UX started in journalism and graphic design where she learned the importance of aesthetics, organization, and catering content for the consumer. She has worked in a number of fields including finance, cloud storage, security and pet health. Jen is now at Fidelity Investments focusing on improving enterprise tools used by employees.\r\nJen loves being active in the UX community to learn and grow while helping others do the same. She is the co-founder of the UX Research and Strategy group, and of IXDA (Interaction Design Association) Dallas. She is the organizer of WIAD (World Information Architecture Day) DFW in 2019 and 2020, and speaker for several local meetups and international conferences like Big Design and Concentric Conference. When not immersed in UX activities and speaking at local meetups, conferences and classes, Jen loves traveling, wine tasting, cooking and spending time with her husband and two doggos, Sadie and Ricky.\r\nLinkedIn: https://www.linkedin.com/in/jenniferblatz/\r\nWebsite: http://jenniferblatzdesign.com/\r\nDribbble: https://dribbble.com/jnblatz\r\nUX Research and Strategy group: https://uxresearchandstrategy.com\r\nTwitter: https://twitter.com@jnblatz","title":"What the “F” is UX and how does it fit in to the agile world? ","description":"There is a lot of confusion about UX. What is it? What’s the difference between UX and UI? How do UX folks relate to and work with developers?\r\nAnd this is just the tip of the iceberg. When the Agile Manifesto was written, UX was not a part of that world. So this brings up even more questions:\r\nHow is UX supposed to fit in to our company’s agile model?\r\nShould UX be part of our agile ceremonies and sprints? How is this all supposed to work. This talk will clarify the mustery of what User Experience is and how to incorporate it in to agile and sprints. \r\n\r\nOutline\r\n•\tDefine UX\r\no\tWhat UX is and is not\r\no\tThe benefits of UX\r\no\tDemystifying the UX and user-centered design process\r\no\tWhat a UX designer actually does\r\no\tValue of user research\r\no\tHow UX can make a developer’s life easier\r\n•\tUX in Agile\r\no\tAgile Manifesto’s principles and how they relate to UX \r\no\tPlanning ahead\r\no\tTimeline and sprints\r\no\tWorking on the team, we’re not a “developer”\r\no\tCollaboration in person and remotely\r\no\tDon’t throw it over the wall\r\n","organization":"Fidelity Investments and UX Research and Strategy group","photoUrl":"https://secure.gravatar.com/avatar/3a2cfecc1ca3f8a4d69ba800a94c290f?s=500","photo":"/photos/speakers/jennifer-blatz.png","room":"nw","time":"4:00"},"nextId":"jerry-koske","previousId":"jeff-strauss"}}
