{"path":"speakers/simon-yost","templateID":4,"sharedPropsHashes":{},"localProps":{"speaker":{"id":"simon-yost","firstName":"Simon","lastName":"Yost","bio":"I empower teams to close the gap between design and engineering so that digital experiences connect people. While specializing in maximizing the potential of multi-disciplinary teams, I create sustainable, nimble digital experiences and technical solutions.\r\n\r\nI have spent 15 years building organizations (startups, nonprofits, and enterprise) in the Midwest region by spearheading digital strategy and content delivery. That includes countless hours coaching professionals and students on building applications, creating digital experiences, and installing systems in their businesses. I currently serve as a technology consultant at Slalom St. Louis.\r\n\r\nOutside of work, I am a husband, father, amateur cyclist, and self-professed coffee aficionado. My passions include foster/adopt parenting and Nebraska football.","title":"Closing the Fidelity Gap with UI Engineering","description":"In 2018 the US market for digital transformation was $437 billion which reflects 16.8% growth year-over-year (Shirer & Smith, 2017). Simultaneously, two-thirds of all business leaders believe that their companies must pick up the pace of digitalization to remain competitive (Moore, 2017). Yet, even with this demand, teams implement solutions that lack of agility. Tangoe’s Murray lays it out: “Developers are coding to specific spec sheets with little conceptual understanding of how this button or feature fits within the overall user experience.”\r\n\r\nThe lack of agility and conceptual understanding of the whole results in a gap—the fidelity gap—where the marriage design and engineering is not as strong as the product creators intended. Symptoms may include a lack of consistency, responsiveness, navigation, and accessibility (Abramov, 2018).\r\n\r\nJoin Simon Yost to explore filling the fidelity gap with stack-neutral concepts and practices that engineering and design teams can work together to champion on any stack.","organization":"Slalom Consulting","photo":"/photos/simonYost.jpg"},"nextId":"thomas-cleberg","previousId":"sandi-barr"}}
